{
  "question_text": "You have an Azure event hub. Each event contains the following fields:<br/><br/>BikepointID -<br/><br/>Street -<br/><br/>Neighbourhood -<br/><br/>Latitude -<br/><br/>Longitude -<br/><br/>No_Bikes -<br/><br/>No_Empty_Docks -<br/>You need to ingest the events. The solution must only retain events that have a Neighbourhood value of Chelsea, and then store the retained events in a Fabric lakehouse.<br/>What should you use?",
  "question_images": [],
  "answers": {
    "A": "a KQL queryset",
    "B": "an eventstream",
    "C": "a streaming dataset",
    "D": "Apache Spark Structured Streaming"
  },
  "answer_images": {},
  "correct_answer": [
    "B"
  ],
  "correct_answer_images": [],
  "discussion": "Eventstream would be most suitable for this.\n\nEventstream is the way to go here. It allows for transformation activities such as filter.\nhttps://learn.microsoft.com/en-us/fabric/real-time-intelligence/event-streams/add-source-azure-event-hubs?pivots=enhanced-capabilities\n\nb is better than D\n\nAn eventstream is designed to handle this type of real-time data processing. It provides the necessary capabilities to:\n\nIngest data from sources like Azure Event Hubs.\n\nFilter and transform the data in real-time.\n\nStore the processed data directly into a destination like a Fabric lakehouse.\n\nThe questions says to store the data in a Fabric lakehouse -> correct answer should be a apache spark structured streaming. Using an eventstream stored the data in KQL database, with optional availability in OneLake, but the questions doesnt state anything about KQL databases, so structured streaming should be the correct answer.\n\nhttps://learn.microsoft.com/en-us/fabric/real-time-intelligence/event-streams/add-destination-lakehouse?pivots=enhanced-capabilities#add-a-lakehouse-as-a-destination\n\nIt's not true. Eventstream coud store into Lakehouse",
  "question_type": "multiple_choice",
  "exam": "dp-700",
  "topic": 2,
  "question_number": 10,
  "url": "https://www.examtopics.com/discussions/microsoft/view/153737-exam-dp-700-topic-2-question-10-discussion/"
}