{
  "question_text": "You have a Fabric workspace that contains an eventhouse and a KQL database named Database1. Database1 has the following:<br/><br/>A table named Table1 -<br/><br/>A table named Table2 -<br/><br/>An update policy named Policy1 -<br/>Policy1 sends data from Table1 to Table2.<br/>The following is a sample of the data in Table2.<br/><br/><img src=\"images/dp-700_topic-2_question-15_html_1.png\" title=\"image49\"/><br/>Recently, the following actions were performed on Table1:<br/>An additional element named temperature was added to the StreamData column.<br/>The data type of the Timestamp column was changed to date.<br/>The data type of the DeviceId column was changed to string.<br/>You plan to load additional records to Table2.<br/>Which two records will load from Table1 to Table2? Each correct answer presents a complete solution.<br/>NOTE: Each correct selection is worth one point.",
  "question_images": [
    "images/dp-700_topic-2_question-15_question_1.png"
  ],
  "answers": {
    "A": "",
    "B": "",
    "C": "",
    "D": ""
  },
  "answer_images": {
    "A": [
      "images/dp-700_topic-2_question-15_answer_A_1.png"
    ],
    "B": [
      "images/dp-700_topic-2_question-15_answer_B_1.png"
    ],
    "C": [
      "images/dp-700_topic-2_question-15_answer_C_1.png"
    ],
    "D": [
      "images/dp-700_topic-2_question-15_answer_D_1.png"
    ]
  },
  "correct_answer": [
    "A",
    "D"
  ],
  "correct_answer_images": [],
  "discussion": "A and D have valid GUIds\n\nRecord B loads because it conforms to the updated schema (string DeviceId, StreamData with temperature).\nRecord D loads because it conforms to the original schema (guid DeviceId, no temperature in StreamData).\n\nThis is incorrect because it was only updated in Table 1. So passing a string to table2 which requires a GUID will fail when it is not a valid guid.\n\nEven if Table 1 has device ID converted to String, Table 2 still expects the device ID to be in GUID. So only rows A and D meets that criteria.\n\nAlso when you insert a date into a datetime column, SQL will automatically convert the date to datetime by adding 00:00:00.000 as the time.\n\nCan somebody please explain the answer? DeviceID is changes to string, so why does it need to have valid GUID-format? In mu opinion, the right answer should be A & B?\n\nChanged my answer to A and D. I initially misinterpreted the question,  since the schema of Table2 has not been updated, only records A and D conform to the existing schema and will be successfully ingested\n\nAD is correct!\n\nSchema Requirements Recap:\nTimestamp must be in date format.\nDeviceId must be a string (GUID is acceptable).\nStreamData must include the temperature field.\nRecord Analysis:\n✅ Record A\nTimestamp: ✅ Valid date (2024-05-18)\nDeviceId: ✅ Valid GUID string\nStreamData: ✅ Includes temperature\n✅ Meets all criteria\n❌ Record B\nTimestamp: ✅ Valid date\nDeviceId: ✅ String (though not a full GUID, still a string)\nStreamData: ✅ Includes temperature\n✅ Technically valid, though DeviceId is not a full GUID, it is a string — acceptable if schema only requires string\n\ntemperature\n\nPlease explain the answer\n\nB and D. \nBecause of GUID fields in the source data - The destination table schema has not been changed.\nThe third field with json data is probably of type nvarchar(max) which can accommodate any json structure.\n\nI meant A and D. Answers with valid GUID\n\nA & C have valid GUIds in correct format and also have temperature column\n\nA & D have valid GUIds\n\nRecords B and C will not load because of invalid GUIDs",
  "question_type": "multiple_choice",
  "exam": "dp-700",
  "topic": 2,
  "question_number": 15,
  "url": "https://www.examtopics.com/discussions/microsoft/view/152974-exam-dp-700-topic-2-question-15-discussion/"
}