{
  "question_text": "You have a Fabric F32 capacity that contains a workspace. The workspace contains a warehouse named DW1 that is modelled by using MD5 hash surrogate keys.<br/>DW1 contains a single fact table that has grown from 200 million rows to 500 million rows during the past year.<br/>You have Microsoft Power BI reports that are based on Direct Lake. The reports show year-over-year values.<br/>Users report that the performance of some of the reports has degraded over time and some visuals show errors.<br/>You need to resolve the performance issues. The solution must meet the following requirements:<br/>Provide the best query performance.<br/>Minimize operational costs.<br/>Which should you do?",
  "question_images": [],
  "answers": {
    "A": "Change the MD5 hash to SHA256.",
    "B": "Increase the capacity.",
    "C": "Enable V-Order.",
    "D": "Modify the surrogate keys to use a different data type.",
    "E": "Create views."
  },
  "answer_images": {},
  "correct_answer": [
    "C"
  ],
  "correct_answer_images": [],
  "discussion": "Enable V-Order: This should be your first step as it directly targets performance improvements with minimal cost.\nConsider the following before deciding to disable V-Order:\nMicrosoft Fabric Direct Lake mode depends on V-Order.\n\nhttps://learn.microsoft.com/en-us/fabric/data-warehouse/v-order#performance-considerations\n\nAfter reviewing the public documentation again, I understand that V-Order is enabled by default in Data Warehouses, as the documentation only refers to how it can be disabled—and notes that this action is irreversible.\n\nhttps://learn.microsoft.com/en-us/fabric/data-warehouse/v-order#scenarios-where-v-order-might-not-be-beneficial\n\nAt the same time, I agree with my peers who mentioned that the row limit per table is 300 million in an F32 capacity. Therefore, I’m updating my answer to option B: Increase the capacity.\n\nhttps://learn.microsoft.com/en-us/fabric/fundamentals/direct-lake-overview#fabric-capacity-requirements\n\nWhat about the limit on the rows limitation (https://learn.microsoft.com/en-us/fabric/fundamentals/direct-lake-overview) ?\n\nDid you read the contents of the url document you wrote?\nhttps://learn.microsoft.com/en-us/fabric/data-warehouse/v-order#performance-considerations\n\n\"Currently, disabling V-Order can only be done at the warehouse level, and it is irreversible: once disabled, it cannot be enabled again. Users must consider the performance if they choose to Disable V-Order in Fabric Warehouse.\"\n\nWould V-Order not already be enabled by default?\n\nis V-order automatically enabled on warehouse?\nNo, V-Order is not automatically enabled on a warehouse. You would need to enable it manually to take advantage of its benefits for improved query performance and data compression.\n\nV-order is enabled by default.\n\nOnly when you are saving in optimized format .. otherwise its not enabled by default.\n\nI still have the same doubt.\n\n500 million rows is over the F32 table limit.\n\nHe's right. When its over the limit the query performance gets reduces by the fallback.\nhttps://learn.microsoft.com/en-us/fabric/fundamentals/direct-lake-overview#fallback\n\nThe best answer is D – modify the surrogate keys to use a different data type.\n\nUsing MD5 hash keys (large 16–32 byte values) causes memory and performance issues as the fact table grows. Switching to integer (INT/BIGINT) surrogate keys reduces memory usage, speeds up joins, and improves storage efficiency.\n\nOther options (like SHA256, increasing capacity, or using views) don’t fix the root problem — the inefficient data type. Integer keys are the best practice for performance and scalability.\n\nB. Increase the capacity\n\nWould improve performance but increases costs, violating the requirement to minimize operational costs.\n\nC. Enable V-Order \n\nV-Order is an optimization in Fabric Warehouses/Lakehouses that orders data column-wise for better compression and query performance.\nSpecifically designed to boost Direct Lake performance.\nCost-neutral (storage optimization, not compute scaling).\n\nBest fit here.\n\nEnable V-Order: reshape parquet files (optimizing its). So, performance should be better, with option B (increase capacity) we have more costs which is one of the question requirement.\n\nF2 <> F3 300 milions row.... Increase capacity is needed\n\nAn F32 SKU in Microsoft Fabric has a limit of 10 GB of memory per semantic model and can handle 300 million Direct Lake rows per table\n\nF32 supports:\n\n300 million rows per table\n40 GB model size on disk\n10 GB max memory\nYour fact table has 500 million rows, which exceeds the supported limit for F32 in Direct Lake mode.\n\nThis mismatch can cause:\n\nVisual errors\nSlow performance\nQuery failures or memory overflows\n🧠 Summary:\nIf you're using Direct Lake and your table exceeds the row or memory limits of your SKU, increasing capacity is necessary to ensure stability and performance.\nV-Order is still a great optimization, but it won’t help if you’re over the SKU limits.\n✅ Final Answer: B. Increase the capacity\n\nBullshit question, the V-Order is turn-on by default. But the question still ask about this :(\n\nOn a table with 500 million rows covering data from multiple years, the main cost is not the JOIN operation but scanning the huge fact table for the relevant dates — so V-Order will make more sense than changing the primary key from MD5 to SHA256.\n\nWith it saying minimize costs I thought it had to be C.\n\nB is the correct answer. V-order is enabled by default; if you disable it, you can't turn it enable again.\n\nV-order is enabled by default.\n\nVorder cant be enabled\n\nDirect Lake mode limit 300 Mill. Fallback option mode switch to Direct Query which degrade the performance. Hence Capacity had to be increased.\n\nMin operational Cost = Enable V Order\n\nWhy Other Options Are Unsuitable:\n\nOption: A (Change MD5→SHA256)\t\nReason for Exclusion: Increases key size (128→256 bits), worsening storage/join performance.\nOption:B (Increase capacity)\t\nReason for Exclusion:Raises costs (contradicts \"minimize operational costs\").\nOption:D (Modify surrogate keys)\t\nReason for Exclusion: Requires rebuilding the entire data model (high effort/cost).\nOption:E (Create views)\t\nReason for Exclusion: Adds abstraction without optimizing underlying data scans.",
  "question_type": "multiple_choice",
  "exam": "dp-700",
  "topic": 1,
  "question_number": 5,
  "url": "https://www.examtopics.com/discussions/microsoft/view/152631-exam-dp-700-topic-1-question-5-discussion/"
}