{
  "question_text": "You have a Fabric workspace that contains a warehouse named Warehouse1. Data is loaded daily into Warehouse1 by using data pipelines and stored procedures.<br/>You discover that the daily data load takes longer than expected.<br/>You need to monitor Warehouse1 to identify the names of users that are actively running queries.<br/>Which view should you use?",
  "question_images": [],
  "answers": {
    "A": "sys.dm_exec_connections",
    "B": "sys.dm_exec_requests",
    "C": "queryinsights.long_running_queries",
    "D": "queryinsights.frequently_run_queries",
    "E": "sys.dm_exec_sessions"
  },
  "answer_images": {},
  "correct_answer": [
    "E"
  ],
  "correct_answer_images": [],
  "discussion": "Use sys.dm_exec_sessions. This view has info about all active user sessions, including user names, session IDs and status.\n\nDon't we want to know about actively-running queries? Shouldn't we run sys.dm_exec_requests as that will give us that information?\n\nhttps://learn.microsoft.com/en-us/sql/relational-databases/system-dynamic-management-views/sys-dm-exec-requests-transact-sql?view=sql-server-ver16\n\nI think the STATUS field in sys.dm_exec_sessions gives us that info\n\nB is correct. sys.dm_exec_sessions can't take care of Active queries.\n\nYes, you can solve the task with E. sys.dm_exec_sessions.\n\nExplanation:\n\nWhile sys.dm_exec_requests (Option B) shows actively running queries, sys.dm_exec_sessions shows all active sessions. To identify users running queries, you can filter sys.dm_exec_sessions on the status column for values like 'running' and check the login_name column.\n\nConclusion:\n\nBoth B and E can be used, but for the specific task of identifying users who are active, sys.dm_exec_sessions is a valid and often more direct choice.\n\nBy Grok: To monitor Warehouse1 in your Fabric workspace and identify the names of users actively running queries, you should use the sys.dm_exec_requests view. This dynamic management view provides information about the requests currently being executed, including the user executing the query, which is essential for identifying active users during the daily data load.\n\nAnswer: B. sys.dm_exec_requests\n\nI am sure Grok is hanging on the words \"users that are actively running queries\" from the question but that is not enough reason to go for B bc 1) sys.dm_exec_sessions has the status column that can be filtered for \"running\" so you get that information anyway and 2) the point of the task is to identify why daily loads are being slowed down and to monitor this, so you won't monitor it in that exact second when you notice it but for several days i.e., weeks looking back on all sessions that were happening at the same time as loads\n\nE is correct\n\nselect distinct   nt_user_name from sys.dm_exec_sessions\nwhere nt_user_name is not null\n\nOption\tView Name\tPurpose\nA\tsys.dm_exec_connections\tShows connection info, not detailed query/user-level execution.\nB\tsys.dm_exec_requests\t Shows active requests including user and query details.\nC\tqueryinsights.long_running_queries\tShows historical long-running queries, not real-time monitoring.\nD\tqueryinsights.frequently_run_queries\tShows frequently run queries, not active users or sessions.\nE\tsys.dm_exec_sessions\tShows session-level info, but lacks specifics about running queries.\n\nWe have to identify the names of users that are actively running queries. sys.dm_exec_requests only gives us user_id but sys.dm_exec_sessions gives us the name (nt_user_name).\n\nsys.dm_exec_connections: This view returns information about the current connections to the database instance, such as the client IP address, the login time, and the number of reads and writes. It focuses on connection details rather than identifying specific user queries.\n\nsys.dm_exec_requests: This view provides information about requests currently executing on the server, including the session ID, request status, and resource consumption. While it can show active requests, it doesn’t necessarily identify the specific users running the queries.\n\nThe sys.dm_exec_sessions view, on the other hand, contains information about all active user connections and internal tasks, including details like the session ID and login name. This makes it more suitable for identifying which users are actively running queries in your database.\n\nsys.dm_exec_sessions is a server-scope view that shows information about all active user connections and internal tasks\n\nsys.dm_exec_sessions",
  "question_type": "multiple_choice",
  "exam": "dp-700",
  "topic": 3,
  "question_number": 6,
  "url": "https://www.examtopics.com/discussions/microsoft/view/153755-exam-dp-700-topic-3-question-6-discussion/"
}