{
  "question_text": "Your company has a sales department that uses two Fabric workspaces named Workspace1 and Workspace2.<br/>The company decides to implement a domain strategy to organize the workspaces.<br/>You need to ensure that a user can perform the following tasks:<br/>Create a new domain for the sales department.<br/>Create two subdomains: one for the east region and one for the west region.<br/>Assign Workspace1 to the east region subdomain.<br/>Assign Workspace2 to the west region subdomain.<br/>The solution must follow the principle of least privilege.<br/>Which role should you assign to the user?",
  "question_images": [],
  "answers": {
    "A": "workspace Admin",
    "B": "domain admin",
    "C": "domain contributor",
    "D": "Fabric admin"
  },
  "answer_images": {},
  "correct_answer": [
    "D"
  ],
  "correct_answer_images": [],
  "discussion": "Only a Fabric Admin can create Domains.\n\nDomain admin can create domains too. Fabric admin violates the principle of least privileges.\n\nFabric Admin oversees domain governance at the tenant level, but the question is not about tenant governance, it’s about: 1. creating one new domain for the sales department 2. creating its subdomains 3. assigning two specific workspaces and most important we must follow least privilege. All of this is contained within a single domain, not global. governance.  \"Domain Admin\" can create domains/subdomain/assign worspaces/permissions only for theirs domain -> least privilege\n\nB is correct answer since it follows the principle of least privilege, not D.\n\nOnly a Fabric Admin can create Domains.\n\nI´m agree with B, because \"Domain Admin\" can create and manage domains and is covering the principle of less privilege.\n\nDomain Admin can work on already created domain, not create it and appoint himself as the admin out of thin air.\nFabric Admin is required\n\nA domain admin has the necessary permissions to:\nCreate a new domain\nCreate subdomains\nAssign workspaces to domains or subdomains\n\nD is correct\n\njust Fabric Adm can create domains\n\nhttps://learn.microsoft.com/en-us/rest/api/fabric/admin/domains/create-domain?tabs=HTTP \nDomains - Create Domain - The caller must be a Fabric administrator.\n\nUser can => Create a new domain for the sales department needs Fabric Admin role. for sub domains Domain Admin should do.\n\nonly fabric admin can create and edit domains\n\nBut first say that have to create a new domain\n\nThe Domain Contributor role provides the exact permissions needed to create subdomains and assign workspaces, without granting excessive privileges. Therefore, C is the best choices\n\nOnly a Fabric Admin can create Domains.\nhttps://learn.microsoft.com/en-us/fabric/governance/domains?source=recommendations\n\nFabric admin (or higher) are the only ones who can create domains\n\nThe question states that user should be able to create Domains. Hence, answer should be D.\n\nhttps://learn.microsoft.com/en-us/fabric/onelake/onelake-shortcuts\n\nDomain Admin \nDomain contributors are workspace Admins (will only be relevant to one workspace)\nhttps://learn.microsoft.com/en-us/fabric/governance/domains#domain-roles\n\nDomain admins can only manage domains they are assigned to. Fabric Admin: Fabric admins can create and edit domains, specify domain admins and contributors, and associate workspaces with domains. They have full visibility and control over all defined domains.\n\nDomain Admin: Domain admins can manage the domains they are assigned to, including creating subdomains and managing domain-specific settings\n\nGiven answer is correct since the domain admin can create a new subdomain but a domain contributor cannot.",
  "question_type": "multiple_choice",
  "exam": "dp-700",
  "topic": 1,
  "question_number": 20,
  "url": "https://www.examtopics.com/discussions/microsoft/view/152871-exam-dp-700-topic-1-question-20-discussion/"
}