{
  "question_text": "HOTSPOT -<br/><br/>Case Study -<br/>This is a case study. Case studies are not timed separately. You can use as much exam time as you would like to complete each case. However, there may be additional case studies and sections on this exam. You must manage your time to ensure that you are able to complete all questions included on this exam in the time provided.<br/>To answer the questions included in a case study, you will need to reference information that is provided in the case study. Case studies might contain exhibits and other resources that provide more information about the scenario that is described in the case study. Each question is independent of the other questions in this case study.<br/>At the end of this case study, a review screen will appear. This screen allows you to review your answers and to make changes before you move to the next section of the exam. After you begin a new section, you cannot return to this section.<br/><br/>To start the case study -<br/>To display the first question in this case study, click the Next button. Use the buttons in the left pane to explore the content of the case study before you answer the questions. Clicking these buttons displays information such as business requirements, existing environment, and problem statements. If the case study has an All Information tab, note that the information displayed is identical to the information displayed on the subsequent tabs. When you are ready to answer a question, click the Question button to return to the question.<br/><br/>Overview. Company Overview -<br/>Contoso, Ltd. is an online retail company that wants to modernize its analytics platform by moving to Fabric. The company plans to begin using Fabric for marketing analytics.<br/><br/>Overview. IT Structure -<br/>The company’s IT department has a team of data analysts and a team of data engineers that use analytics systems.<br/>The data engineers perform the ingestion, transformation, and loading of data. They prefer to use Python or SQL to transform the data.<br/>The data analysts query data and create semantic models and reports. They are qualified to write queries in Power Query and T-SQL.<br/><br/>Existing Environment. Fabric -<br/>Contoso has an F64 capacity named Cap1. All Fabric users are allowed to create items.<br/>Contoso has two workspaces named WorkspaceA and WorkspaceB that currently use Pro license mode.<br/>Existing Environment. Source Systems<br/>Contoso has a point of sale (POS) system named POS1 that uses an instance of SQL Server on Azure Virtual Machines in the same Microsoft Entra tenant as Fabric. The host virtual machine is on a private virtual network that has public access blocked. POS1 contains all the sales transactions that were processed on the company’s website.<br/>The company has a software as a service (SaaS) online marketing app named MAR1. MAR1 has seven entities. The entities contain data that relates to email open rates and interaction rates, as well as website interactions. The data can be exported from MAR1 by calling REST APIs. Each entity has a different endpoint.<br/>Contoso has been using MAR1 for one year. Data from prior years is stored in Parquet files in an Amazon Simple Storage Service (Amazon S3) bucket. There are 12 files that range in size from 300 MB to 900 MB and relate to email interactions.<br/>Existing Environment. Product Data<br/>POS1 contains a product list and related data. The data comes from the following three tables:<br/><br/>Products -<br/><br/>ProductCategories -<br/><br/>ProductSubcategories -<br/>In the data, products are related to product subcategories, and subcategories are related to product categories.<br/><br/>Existing Environment. Azure -<br/>Contoso has a Microsoft Entra tenant that has the following mail-enabled security groups:<br/>DataAnalysts: Contains the data analysts<br/>DataEngineers: Contains the data engineers<br/>Contoso has an Azure subscription.<br/>The company has an existing Azure DevOps organization and creates a new project for repositories that relate to Fabric.<br/>Existing Environment. User Problems<br/>The VP of marketing at Contoso requires analysis on the effectiveness of different types of email content. It typically takes a week to manually compile and analyze the data. Contoso wants to reduce the time to less than one day by using Fabric.<br/>The data engineering team has successfully exported data from MAR1. The team experiences transient connectivity errors, which causes the data exports to fail.<br/><br/>Requirements. Planned Changes -<br/>Contoso plans to create the following two lakehouses:<br/>Lakehouse1: Will store both raw and cleansed data from the sources<br/>Lakehouse2: Will serve data in a dimensional model to users for analytical queries<br/>Additional items will be added to facilitate data ingestion and transformation.<br/>Contoso plans to use Azure Repos for source control in Fabric.<br/>Requirements. Technical Requirements<br/>The new lakehouses must follow a medallion architecture by using the following three layers: bronze, silver, and gold. There will be extensive data cleansing required to populate the MAR1 data in the silver layer, including deduplication, the handling of missing values, and the standardizing of capitalization.<br/>Each layer must be fully populated before moving on to the next layer. If any step in populating the lakehouses fails, an email must be sent to the data engineers.<br/>Data imports must run simultaneously, when possible.<br/>The use of email data from the Amazon S3 bucket must meet the following requirements:<br/>Minimize egress costs associated with cross-cloud data access.<br/>Prevent saving a copy of the raw data in the lakehouses.<br/>Items that relate to data ingestion must meet the following requirements:<br/>The items must be source controlled alongside other workspace items.<br/>Ingested data must land in the bronze layer of Lakehouse1 in the Delta format.<br/>No changes other than changes to the file formats must be implemented before the data lands in the bronze layer.<br/>Development effort must be minimized and a built-in connection must be used to import the source data.<br/>In the event of a connectivity error, the ingestion processes must attempt the connection again.<br/>Lakehouses, data pipelines, and notebooks must be stored in WorkspaceA. Semantic models, reports, and dataflows must be stored in WorkspaceB.<br/>Once a week, old files that are no longer referenced by a Delta table log must be removed.<br/>Requirements. Data Transformation<br/>In the POS1 product data, ProductID values are unique. The product dimension in the gold layer must include only active products from product list. Active products are identified by an IsActive value of 1.<br/>Some product categories and subcategories are NOT assigned to any product. They are NOT analytically relevant and must be omitted from the product dimension in the gold layer.<br/><br/>Requirements. Data Security -<br/>Security in Fabric must meet the following requirements:<br/>The data engineers must have read and write access to all the lakehouses, including the underlying files.<br/>The data analysts must only have read access to the Delta tables in the gold layer.<br/>The data analysts must NOT have access to the data in the bronze and silver layers.<br/>The data engineers must be able to commit changes to source control in WorkspaceA.<br/>You need to create the product dimension.<br/>How should you complete the Apache Spark SQL code? To answer, select the appropriate options in the answer area.<br/>NOTE: Each correct selection is worth one point.<br/><img src=\"images/dp-700_topic-2_question-5_html_1.png\" title=\"image35\"/>",
  "question_images": [
    "images/dp-700_topic-2_question-5_question_1.png"
  ],
  "answers": {},
  "answer_images": {},
  "correct_answer": [],
  "correct_answer_images": [
    "images/dp-700_topic-2_question-5_correct_1.png"
  ],
  "discussion": "LEFT OUTER JOIN\n\nINNER JOIN\n\nIsActive = 1\n\nthe first join should be left because we want to keep all the products. Second should be inner to omit unused categories\n\nWe need to keep active products\n\nIn the POS1 product data, ProductID values are unique. The product dimension in the gold layer must include only active products from product list. Active products are identified by an IsActive value of 1.\nSome product categories and subcategories are NOT assigned to any product. They are NOT analytically relevant and must be omitted from the product dimension in the gold layer.\n\nI agree. I don't get why they put Category left and Subcategory right in the second join, otherwise LEFT LEFT would be simple and correct.\n\nInner Join \nInner Join\nIs Active\n\nIf use left outer join, eventual still need a where clause to filter out the product has no category and sub-category, since they are analytic irrelevant and have to be omitted in the gold layer\n\nbased on the following conditions I go for INNER JOIN/INNER JOIN/IsActive = 1.\nUsing a LEFT OUTER JOIN would keep products even if they do not have a subcategory or category You would need to add extra WHERE conditions to filter out unmatched products\n\n1. The dimension must contain only active products.\n2. Any category or subcategory that has no product must be omitted.\n3. ProductID values are unique, so there is exactly one product row per ProductID.\n\nSome product categories and subcategories are NOT assigned to any product. They are NOT analytically relevant and must be omitted from the product dimension in the gold layer.\nthis is why use inner join \nIf the product is not categorized, it will not be analyzed.\n\nFROM ContosoLake.Products p\nINNER JOIN ContosoLake.ProductSubCategories s ON p.SubCategoryID = s.SubCategoryID\nINNER JOIN ContosoLake.ProductCategories   c ON c.CategoryID   = s.CategoryID\nWHERE IsActive = 1;\n\nGuys, think about it, if you are in a real project and need to build this dimension, will you use INNER ?  It could exists products without Categories, and I haven't seem anywhere saying that all products have categories. You are excluding this products. The answer should be .  LEFT OUTER JOIN, LEFT OUTER JOIN and IsActive = 1\n\nUsing an INNER JOIN or a LEFT JOIN between Products and ProductSubCategories produces the same result in this case because the second join to ProductCategories is an INNER JOIN, which automatically filters out any rows with missing subcategory or category links. However, we prefer using an INNER JOIN in the first join because it is typically faster and more efficient — it processes fewer rows by returning only matched records, reducing memory usage and improving query performance.\n\nAlso it says\n\"Some product categories and subcategories are NOT assigned to any product. They are NOT analytically relevant and must be omitted from the product dimension in the gold layer.\"\n\nINNER INNER IsActive = 1\n\nThe product dimension in the gold layer must include only active products from product list. Active products are identified by an IsActive value of 1.\nSome product categories and subcategories are NOT assigned to any product. They are NOT analytically relevant and must be omitted from the product dimension in the gold layer.\n\nLEFT INNER at the end is the same result but why LEFT first if the second join is INNER?\n\nrealexamguru's comment is correct. According to the info, there is no difference between left join and inner join in this case. \nThere would be difference when there are Products with empty values for CategoryId and SubcategoryId fields.\n\nleft outer/left outer/isactive=1\nFirst left outer: This way you keep all your products. It doesn't say you want to filter out products without an subcategory.\nSecond left outer: If you use inner join, subcategories without a category will be filtered out. That's not the question. You want to keep subcategories even without a category. So, left outer.\nIsActive = 1: No discussion I think.\n\nInner Join / Inner Join / IsActive = 1 if all products have subcategories\nLeft Outer Join / Left Outer Join / IsActive = 1 if some products are missing subcategory information\nBased on the the details that we have there should be no difference between a left join and an inner join. We know there are some extra categories and subcategories but we don't know if there is any product without a subcategory. Probably we are missing another piece of information. I prefer inner join since it performs better.\nFull Join and anti join are just obviously incorrect. And there's no such thing as an outer join.\n\nleft outer; left outer; IsActive = 1\nThe above can achieve the requirements below as well:\n- In the POS1 product data, ProductID values are unique. The product dimension in the gold layer must include only active products from product list. Active products are identified by an IsActive value of 1.\n- Some product categories and subcategories are NOT assigned to any product. They are NOT analytically relevant and must be omitted from the product dimension in the gold layer.",
  "question_type": "image_only",
  "exam": "dp-700",
  "topic": 2,
  "question_number": 5,
  "url": "https://www.examtopics.com/discussions/microsoft/view/154682-exam-dp-700-topic-2-question-5-discussion/"
}