{
  "question_text": "You have a Fabric capacity that contains a workspace named Workspace1. Workspace1 contains a lakehouse named Lakehouse1, a data pipeline, a notebook, and several Microsoft Power BI reports.<br/>A user named User1 wants to use SQL to analyze the data in Lakehouse1.<br/>You need to configure access for User1. The solution must meet the following requirements:<br/>Provide User1 with read access to the table data in Lakehouse1.<br/>Prevent User1 from using Apache Spark to query the underlying files in Lakehouse1.<br/>Prevent User1 from accessing other items in Workspace1.<br/>What should you do?",
  "question_images": [],
  "answers": {
    "A": "Share Lakehouse1 with User1 directly and select Read all SQL endpoint data.",
    "B": "Assign User1 the Viewer role for Workspace1. Share Lakehouse1 with User1 and select Read all SQL endpoint data.",
    "C": "Share Lakehouse1 with User1 directly and select Build reports on the default semantic model.",
    "D": "Assign User1 the Member role for Workspace1. Share Lakehouse1 with User1 and select Read all SQL endpoint data."
  },
  "answer_images": {},
  "correct_answer": [
    "A"
  ],
  "correct_answer_images": [],
  "discussion": "Read Access to Table Data.\n\nB/D - Viewer/Member can access other items\nC - cannot access SQL DB\n\nAssigning the Viewer role would grant User1 access to all items in the workspace, violating the requirement to restrict access to Lakehouse1 only.\n\nRead table data using SQL:\nThe SQL endpoint provides a structured interface for querying lakehouse tables without invoking Apache Spark.\n\nSelecting “Read all SQL endpoint data” gives User1 SQL read access to the tables in Lakehouse1.\nPrevent Apache Spark access:\n\nBy not assigning workspace-level roles (like Viewer, Member, or Admin), User1 won't see or access notebooks or Spark-powered tools.\nLimit visibility to only Lakehouse1:\n\nSharing Lakehouse1 directly (instead of the entire workspace) ensures User1 has visibility only into what you explicitly share.\n\nin that case workspace also needs some access, workspace should be having viewer access\n\nA is correct\n\njust read to LH\n\nThe most logical one\n\nAgree with other solutions",
  "question_type": "multiple_choice",
  "exam": "dp-700",
  "topic": 1,
  "question_number": 22,
  "url": "https://www.examtopics.com/discussions/microsoft/view/152873-exam-dp-700-topic-1-question-22-discussion/"
}