{
  "question_text": "Case Study -<br/><br/>This is a case study. Case studies are not timed separately. You can use as much exam time as you would like to complete each case. However, there may be additional case studies and sections on this exam. You must manage your time to ensure that you are able to complete all questions included on this exam in the time provided.<br/><br/>To answer the questions included in a case study, you will need to reference information that is provided in the case study. Case studies might contain exhibits and other resources that provide more information about the scenario that is described in the case study. Each question is independent of the other questions in this case study.<br/><br/>At the end of this case study, a review screen will appear. This screen allows you to review your answers and to make changes before you move to the next section of the exam. After you begin a new section, you cannot return to this section.<br/><br/><br/>To start the case study -<br/>To display the first question in this case study, click the Next button. Use the buttons in the left pane to explore the content of the case study before you answer the questions. Clicking these buttons displays information such as business requirements, existing environment, and problem statements. If the case study has an All Information tab, note that the information displayed is identical to the information displayed on the subsequent tabs. When you are ready to answer a question, click the Question button to return to the question.<br/><br/><br/>Overview -<br/><br/>Litware, Inc. is a publishing company that has an online bookstore and several retail bookstores worldwide. Litware also manages an online advertising business for the authors it represents.<br/><br/>Existing Environment. Fabric Environment<br/><br/>Litware has a Fabric workspace named Workspace1. High concurrency is enabled for Workspace1.<br/><br/>The company has a data engineering team that uses Python for data processing.<br/><br/>Existing Environment. Data Processing<br/><br/>The retail bookstores send sales data at the end of each business day, while the online bookstore constantly provides logs and sales data to a central enterprise resource planning (ERP) system.<br/><br/>Litware implements a medallion architecture by using the following three layers: bronze, silver, and gold. The sales data is ingested from the ERP system as Parquet files that land in the Files folder in a lakehouse. Notebooks are used to transform the files in a Delta table for the bronze and silver layers. The gold layer is in a warehouse that has V-Order disabled.<br/><br/>Litware has image files of book covers in Azure Blob Storage. The files are loaded into the Files folder.<br/><br/>Existing Environment. Sales Data<br/><br/>Month-end sales data is processed on the first calendar day of each month. Data that is older than one month never changes.<br/><br/>In the source system, the sales data refreshes every six hours starting at midnight each day.<br/><br/>The sales data is captured in a Dataflow Gen1 dataflow. When the dataflow runs, new and historical data is captured. The dataflow captures the following fields of the source:<br/><br/>•\tSales Date<br/>•\tAuthor<br/>•\tPrice<br/>•\tUnits<br/>•\tSKU<br/><br/>A table named AuthorSales stores the sales data that relates to each author. The table contains a column named AuthorEmail. Authors authenticate to a guest Fabric tenant by using their email address.<br/><br/>Existing Environment. Security Groups<br/><br/>Litware has the following security groups:<br/><br/>•\tSales<br/>•\tFabric Admins<br/>•\tStreaming Admins<br/><br/>Existing Environment. Performance Issues<br/><br/>Business users perform ad-hoc queries against the warehouse. The business users indicate that reports against the warehouse sometimes run for two hours and fail to load as expected. Upon further investigation, the data engineering team receives the following error message when the reports fail to load: “The SQL query failed while running.”<br/><br/>The data engineering team wants to debug the issue and find queries that cause more than one failure.<br/><br/>When the authors have new book releases, there is often an increase in sales activity. This increase slows the data ingestion process.<br/><br/>The company’s sales team reports that during the last month, the sales data has NOT been up-to-date when they arrive at work in the morning.<br/><br/><br/>Requirements. Planned Changes -<br/><br/>Litware recently signed a contract to receive book reviews. The provider of the reviews exposes the data in Amazon Simple Storage Service (Amazon S3) buckets.<br/><br/>Litware plans to manage Search Engine Optimization (SEO) for the authors. The SEO data will be streamed from a REST API.<br/><br/><br/>Requirements. Version Control -<br/><br/>Litware plans to implement a version control solution in Fabric that will use GitHub integration and follow the principle of least privilege.<br/><br/>Requirements. Governance Requirements<br/><br/>To control data platform costs, the data platform must use only Fabric services and items. Additional Azure resources must NOT be provisioned.<br/><br/><br/>Requirements. Data Requirements -<br/><br/>Litware identifies the following data requirements:<br/><br/>•\tProcess the SEO data in near-real-time (NRT).<br/>•\tMake the book reviews available in the lakehouse without making a copy of the data.<br/>•\tWhen a new book cover image arrives in the Files folder, process the image as soon as possible.<br/><br/><br/>You need to create a workflow for the new book cover images.<br/><br/>Which two components should you include in the workflow? Each correct answer presents part of the solution.<br/><br/>NOTE: Each correct selection is worth one point.",
  "question_images": [],
  "answers": {
    "A": "a time-based schedule",
    "B": "a streaming dataflow",
    "C": "a blob storage action",
    "D": "a data pipeline",
    "E": "a notebook that uses Apache Spark Structured Streaming",
    "F": "a reflex item"
  },
  "answer_images": {},
  "correct_answer": [
    "D",
    "F"
  ],
  "correct_answer_images": [],
  "discussion": "D. Data pipeline – for orchestration.\nF. Reflex item – for event-driven triggers within Fabric (e.g., file arrival in the Files folder).\nThese two are fully Fabric-native, meet the real-time processing requirement, and comply with governance policies.\n\nThe driving event is not the arrival of the file in the Fabric folder, but the arrival of the file in the Azure blog storage - thus answer CD.\n\nActually no. As stated in the Data section of case-study \"When a new book cover image arrives in the Files folder, process the image as soon as possible.\" implying it is exaclty the opposite of what you said at it matters when the picture lands in Lakehouse Files, not when it had arrived in the Blob storage before that.\n\ndata pipleline can match this requirement and it will create a reflex object when we set storage event triggers on a pipeline. However, it looks like Microsoft has been changed reflex item with new name as Activator in Fabric. It always changed their words and very hard to remember them. By the way, I remember Fabric has been retired streaming dataflow, why they always added it in their new exam questions?\n\nhttps://learn.microsoft.com/en-us/fabric/data-factory/pipeline-storage-event-triggers\n\nIt is Reflex, the name givem by a pipeline in eventstream. That is the correct answer.\n\nData Pipeline\nReflex Ítem\n\ni'm agree with cd\n\nA blob storage action (C): This will trigger the workflow when a new image file is uploaded to the Azure Blob Storage.\nA data pipeline (D): This will orchestrate the processing of the new image file, ensuring that the necessary transformations and actions are performed.\n\nIf answer \"a blob storage action\" means one of action in Azure Blob Storage events, such as \"Microsoft.Storage.BlobCreated\". I can agree to choose it because we can choose \"Azure Blob Storage events\" in source when we set trigger(alert) for pipeline. Complaining again about the quality of their questions, which are filled with a lot of vague descriptions.\n\ncan be achieved using data pipeline and blob storage event scheduling",
  "question_type": "multiple_choice",
  "exam": "dp-700",
  "topic": 2,
  "question_number": 22,
  "url": "https://www.examtopics.com/discussions/microsoft/view/302487-exam-dp-700-topic-2-question-22-discussion/"
}