{
  "question_text": "You have a Fabric F32 capacity that contains a workspace. The workspace contains a warehouse named DW1 that is modelled by using MD5 hash surrogate keys.<br/><br/>DW1 contains a single fact table that has grown from 200 million rows to 500 million rows during the past year.<br/><br/>You have Microsoft Power BI reports that are based on Direct Lake. The reports show year-over-year values.<br/><br/>Users report that the performance of some of the reports has degraded over time and some visuals show errors.<br/><br/>You need to resolve the performance issues. The solution must meet the following requirements:<br/><br/>•\tProvide the best query performance.<br/>•\tMinimize operational costs.<br/><br/>Which should you do?",
  "question_images": [],
  "answers": {
    "A": "Create views.",
    "B": "Modify the surrogate keys to use a different data type.",
    "C": "Change the MD5 hash to SHA256.",
    "D": "Increase the capacity.",
    "E": "Disable V-Order on the warehouse."
  },
  "answer_images": {},
  "correct_answer": [
    "D"
  ],
  "correct_answer_images": [],
  "discussion": "D - Capacity. F32 is too low\n\nwont increasing the capacity increase cost ?\n\nGood point but another point\nDW1 contains a single fact table that has grown from 200 million rows to 500 million rows during the past year.\nF32 Capacity \n** Tables in a Power BI semantic model using Direct Lake mode on an F32 capacity are limited to 300 million rows per table\nany comments from the Team\n\nNumber of rows.. > Capacity\n\nDuplicate of Question#5\n\nhttps://learn.microsoft.com/en-us/fabric/fundamentals/direct-lake-overview#:~:text=model%20permissions.-,Fabric%20capacity%20requirements,-Direct%20Lake%20semantic\n\nLimitation of Direct Lake/F32 - Rows per table --> 300 millions\n\nWhile adding capacity would possibly do this, minimizing costs pushes us to select B, as changing a string type to an INT type would improve performance. Will it be enough... no way to measure but it would be the first step I would take\n\nI dunno if this answer is correct within the exam. But it only can be: D. 300 Mio Row Lmitations in a warehouse at F32. \n\nOtherwise, we could split into to Views, to be within the Row Limits of 200 and 300 rows, for two different Years.\n\nWe should increase the capacity.\nCheck this explanation\nhttps://www.youtube.com/watch?v=LX3EJX-LIFY&list=PLO3dD0hSou5e4ErRvooMc-ifeotjAt06g&index=4\n\nChanging surrogate keys from MD5 (string) to integers improves query speed, storage efficiency, and reduces costs.\n\nDid you consider how much ETL cost will increase? Using and int key requires a join of fact and dimension tables to assign the keys while a hash does not.\n\nModify the surrogate keys to use a different data type\n\nWhy?\n- MD5 hash surrogate keys are 128-bit values, which can be inefficient for large datasets.\n- Switching to a more efficient data type (such as BIGINT or INT) reduces storage and processing overhead, improving query performance.\n- Smaller data types are faster to process, leading to better indexing and query execution.\nAnswer validated with ChatGPT\n\nModify the surrogate keys to use a different data type.",
  "question_type": "multiple_choice",
  "exam": "dp-700",
  "topic": 1,
  "question_number": 59,
  "url": "https://www.examtopics.com/discussions/microsoft/view/304636-exam-dp-700-topic-1-question-59-discussion/"
}