{
  "question_text": "DRAG DROP -<br/>You are implementing the following data entities in a Fabric environment:<br/>Entity1: Available in a lakehouse and contains data that will be used as a core organization entity<br/>Entity2: Available in a semantic model and contains data that meets organizational standards<br/>Entity3: Available in a Microsoft Power BI report and contains data that is ready for sharing and reuse<br/>Entity4: Available in a Power BI dashboard and contains approved data for executive-level decision making<br/>Your company requires that specific governance processes be implemented for the data.<br/>You need to apply endorsement badges to the entities based on each entity’s use case.<br/>Which badge should you apply to each entity? To answer, drag the appropriate badges the correct entities. Each badge may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.<br/>NOTE: Each correct selection is worth one point.<br/><img src=\"images/dp-700_topic-1_question-23_html_1.png\" title=\"image14\"/>",
  "question_images": [
    "images/dp-700_topic-1_question-23_question_1.png"
  ],
  "answers": {},
  "answer_images": {},
  "correct_answer": [],
  "correct_answer_images": [
    "images/dp-700_topic-1_question-23_correct_1.png"
  ],
  "discussion": "Entity1: core organization entity --> Master Data\nEntity2: meets organizational standards --> Certified\nEntity3: ready for sharing and reuse --> Promoted\nEntity4: Power BI dashboard, executive-level decision making --> Cannot be endorsed, The reason is Types of items that can be endorsed\nAll Fabric items and Power BI items except Power BI dashboards can be promoted or certified.\n\nthis is correct\n\nWtf is a 'data entity' anyway? Dashboard doesn't hold any data and cannot be endorsed\n\nEntity1: Master Data\nEntity2: Certified\nEntity3: Promoted\nEntity4: Master Data( Dashboards cannot be promoted or certified, but they can be endorsed as master data), so it is the only option for Entity4. You can find this information in the microsoft documentation\n\nTHese are drag and drop so it makes no sense that two of those are of the same type\n\nEach badge may be used once, more than once, or not at all\n\n4 IS CANNOT endorse\n\nEntity1: core organization entity --> Master Data\nEntity2: meets organizational standards --> Certified\nEntity3: ready for sharing and reuse --> Promoted\nEntity4: Power BI dashboard, executive-level decision making --> certified\n\nEntity1: core organization entity --> Master Data\nEntity2: meets organizational standards --> Certified\nEntity3: ready for sharing and reuse --> Promoted\nEntity4: Power BI dashboard, executive-level decision making --> Cannot be endorsed, The reason is Master data can only be applied to lakehouse and models.\n\nTricky one: on first sight entity 4 cannot be endorsed: https://learn.microsoft.com/en-us/fabric/governance/endorsement-overview : \"Any Fabric or Power BI item except Power BI dashboards can be promoted\"\n\nHowever: is entity 4 in fact referring to the semantic model underlying the report? Since that model is available through the report? In that case it should be 'Certified'.\nVery unclear/tricky question\n\nEntity 4 should be 'Cannot be endorsed.' In my opinion, \n\"The master data label can only be applied to items that contain data, such as lakehouses and semantic models.\"\nhttps://learn.microsoft.com/en-us/fabric/governance/endorsement-overview\n\nAll are correct EXCEPT Entity4: Power BI dashboards cannot be endorsed, according to Microsoft official documentation.\nhttps://learn.microsoft.com/en-us/fabric/governance/endorsement-overview#types-of-items-that-can-be-endorsed\n\nAnswer is correct according to this. https://learn.microsoft.com/en-us/fabric/governance/endorsement-overview\nSince there is no other suitable badge for Entity 3, it should be labelled as Certified.",
  "question_type": "drag_drop",
  "exam": "dp-700",
  "topic": 1,
  "question_number": 23,
  "url": "https://www.examtopics.com/discussions/microsoft/view/155287-exam-dp-700-topic-1-question-23-discussion/"
}