{
  "question_text": "HOTSPOT -<br/>You have a Fabric workspace that contains a warehouse named DW1. DW1 contains the following tables and columns.<br/><img src=\"images/dp-700_topic-1_question-6_html_1.png\" title=\"image1\"/><br/>You need to create an output that presents the summarized values of all the order quantities by year and product. The results must include a summary of the order quantities at the year level for all the products.<br/>How should you complete the code? To answer, select the appropriate options in the answer area.<br/>NOTE: Each correct selection is worth one point.<br/><img src=\"images/dp-700_topic-1_question-6_html_2.png\" title=\"image2\"/>",
  "question_images": [
    "images/dp-700_topic-1_question-6_question_1.png",
    "images/dp-700_topic-1_question-6_question_2.png"
  ],
  "answers": {},
  "answer_images": {},
  "correct_answer": [
    "A"
  ],
  "correct_answer_images": [],
  "discussion": "SELECT YEAR\n\n\nGrouping Sets: Best answer. No extra stuff. Just what we want\nCube: Lots of extra combinations. Has a row with the total for all years and all products, and rows with the total for each product for all years. \nRollup: Has the unnecessary total of all products and all years\nNormal Group by: No summary at the year level for all products.\n\nhttps://learn.microsoft.com/en-us/sql/t-sql/queries/select-group-by-transact-sql?view=sql-server-ver16\n\nBut the requirement says:\nThe results must include a summary of the order quantities at the year level for all the products.\nTherefore ROLLUP should be correct.\n\nFor example, GROUP BY ROLLUP (Country, Region) and GROUP BY GROUPING SETS ( ROLLUP (Country, Region) ) return the same results.\n\nSELECT YEAR\nROLLUP(YEAR(SO.ModifiedDATE), P.Name)\n\nWhy not plain Group By when it serves the purpose. We can get the summary anyway without adding an additional clause ?\n\nBecause it does not serve the purpose. Requirements are:\n1. Summarize order quantities by year and product.\n2. Include a summary of order quantities at the year level for all products.\nA simple GROUP BY cannot generate subtotals or a grand total. You would need to write multiple queries and combine them with UNION ALL, which is inefficient and cumbersome.\n\nRollup adds extra row for grand total (all years, all products), which is not requested. Grouping Sets works better\n\nselect year and group sets\n\nROLLUP is typically the best choice because:\nIt's concise and readable\nMost databases support it (SQL Server, MySQL, PostgreSQL, Oracle)\nIt automatically generates the hierarchical summary\nIt's efficient for large datasets\n\nSELECT YEAR... To extract the year like a field\nROLLUP ... to achieve the full sales.\n\nSELECT YEAR\nROLLUP(YEAR(SO.ModifiedDATE), P.Name)\n\nBetween ROLLUP and GROUPING_SETS in this case, GROUPING_SETS is the correct answer. \nThough both options will give us the rows stated in the requirement, ROLLUP will give an extra row with total_qty over all the products and all the years (rolling up the products and years). This is not part of the requirement.\n\nSELECT YEAR(SO.ModifiedDate) AS OrderDate,\n       P.Name AS ProductName,\n       SUM(SO.OrderQty) AS OrderQty\nFROM [dbo].[SalesOrderDetail] SO\nINNER JOIN [dbo].[Product] P ON P.ProductID = SO.ProductID\nGROUP BY ROLLUP(YEAR(SO.ModifiedDate), P.Name)\nORDER BY OrderDate\n\nSELECT YEAR\nGROUPING SETS(...)\n\nFirst answer: YEAR\nSecond answer: ROLLUP...\n\nSelected Answer: C\nExplanation:\nYEAR(SO.ModifiedDate) extracts the year.\n\nROLLUP(YEAR(SO.ModifiedDate), P.Name) groups the data by year and product, and adds a subtotal at the year level (i.e., all products for a given year).\n\nThe result will include rows with NULL in ProductName for the yearly totals.\n\nSelected Answer: C\n\nROLLUP is correct\n\nSELECT YEAR\nGROUPING SETS(...)\n\n1.Year\n2. Grouping sets\n\nQuestion asks for summarized values of all the order quantities by year/product AND year alone , so grouping sets its correct\n1.Year\n2. Grouping sets\n\nBut ROLLUP performs better for these hierarchical aggregations, it might be better to go with ROLLUP\n\nROLLUP will add one extra Total row that is not requested in the question, so the only correct answer is grouping sets here.\n\nSELECT YEAR\nGROUPING SETS(...)\n\nIf you use ROLLUP then you will get an extra row that sums up the OrderQty total. \nThis is not requested, ROLLUP returns exactly what we need.",
  "question_type": "image_only",
  "exam": "dp-700",
  "topic": 1,
  "question_number": 6,
  "url": "https://www.examtopics.com/discussions/microsoft/view/153079-exam-dp-700-topic-1-question-6-discussion/"
}