{
  "question_text": "You have a Fabric workspace that contains an eventstream named Eventstream1. Eventstream1 processes data from a thermal sensor by using event stream processing, and then stores the data in a lakehouse.<br/>You need to modify Eventstream1 to include the standard deviation of the temperature.<br/>Which transform operator should you include in the Eventstream1 logic?",
  "question_images": [],
  "answers": {
    "A": "Expand",
    "B": "Group by",
    "C": "Union",
    "D": "Aggregate"
  },
  "answer_images": {},
  "correct_answer": [
    "B"
  ],
  "correct_answer_images": [],
  "discussion": "The Group by transform operator contains the Standard deviation aggregation. The Aggregate transform operator only contains Average, Max, Min and Sum aggregation.\n\nhttps://learn.microsoft.com/en-us/fabric/real-time-intelligence/event-streams/process-events-using-event-processor-editor?pivots=standard-capabilities#group-by\n\nIn Fabric Eventstream transform events,  Standard Deviation is an option under GroupBy. In Aggregation you just have Average, Minimum, Maximum and SUM. I have checked in Fabric.\n\nLooking in Fabric Eventstream transform events. \nI can confirm Standard Deviation is an option under GroupBy. \nIt is not under Aggregate.\n\nThe correct answer is: D. Aggregate\n\nTo include the standard deviation of the temperature in your event stream logic in Microsoft Fabric, you need to use the Aggregate transform operator. This operator allows you to perform statistical calculations such as:\n\nAverage\nCount\nMin/Max\nSum\nStandard deviation\nHere's a quick breakdown of the other options and why they don't apply:\n\nA. Expand: Used to flatten nested data structures, not for statistical calculations.\nB. Group by Most Voted: Used to group data based on the most frequent value, not for computing standard deviation.\nC. Union: Combines multiple streams, but doesn’t perform calculations.\nD. Aggregate: ✅ Correct — used for computing metrics like standard deviation.\nWould you like help modifying the Eventstream1 logic to include this transformation?\n\n\"Group By\" is for grouping data but calculates is realized by some \"aggregation\".\n\nStandard Deviation is only available in Group by, not Aggregate operator\n\nwhile Group by is useful for creating groups, it does not provide the full range of aggregate functions that Aggregate does, including the standard deviation. This is why the Aggregate operator is the correct choice.\n\nChanged to B",
  "question_type": "multiple_choice",
  "exam": "dp-700",
  "topic": 2,
  "question_number": 9,
  "url": "https://www.examtopics.com/discussions/microsoft/view/153727-exam-dp-700-topic-2-question-9-discussion/"
}