{
  "question_text": "You have a Fabric workspace named Workspace1.<br/>You plan to integrate Workspace1 with Azure DevOps.<br/>You will use a Fabric deployment pipeline named deployPipeline1 to deploy items from Workspace1 to higher environment workspaces as part of a medallion architecture. You will run deployPipeline1 by using an API call from an Azure DevOps pipeline.<br/>You need to configure API authentication between Azure DevOps and Fabric.<br/>Which type of authentication should you use?",
  "question_images": [],
  "answers": {
    "A": "service principal",
    "B": "Microsoft Entra username and password",
    "C": "managed private endpoint",
    "D": "workspace identity"
  },
  "answer_images": {},
  "correct_answer": [
    "A"
  ],
  "correct_answer_images": [],
  "discussion": "A service principal is the recommended authentication method when automating deployments and integrations between Azure DevOps and Microsoft Fabric. It provides a secure, scalable, and manageable way to authenticate API calls—especially from CI/CD systems like Azure DevOps pipelines—without requiring user credentials.\n\nThe relevant documentation I found to support Service Principals is this: https://learn.microsoft.com/en-us/rest/api/fabric/articles/get-started/fabric-api-quickstart\n\nSpecifically calling out integrating with the API by creating a Service Principal (App Registration) in the Entra tenant.\n\nA is correct\n\nA is correct\n\nAnnouncing Service Principal support for Fabric APIs:\n\nhttps://blog.fabric.microsoft.com/en-au/blog/announcing-service-principal-support-for-fabric-apis/#:~:text=Service%20principal%20is%20a%20security,integrate%20them%20with%20other%20services.\n\nMicrosoft Entra supported identities\nThis API supports the Microsoft identities listed in this section.\n\nIdentity\tSupport\nUser\tYes\nService principal and Managed identities\tOnly Power BI Items are supported   . ref https://learn.microsoft.com/en-us/rest/api/fabric/core/deployment-pipelines/deploy-stage-content?tabs=HTTP\n\nA service principal is an identity created for use with applications, hosted services, and automated tools to access Azure resources. It provides a secure, non-interactive way for Azure DevOps pipelines to authenticate and interact with Fabric APIs without needing user credentials.\n\nService principal is only supported for Power BI Items deployment. In this question no details is given so assume warehouses and laekhouses are there as well. So the right qnswer is User\n\nI don't understand this. I use Services Principal for some tools that connect to warehouse\n\nto interact with azure services and devops to implement automation, service principal is most commonly used\n\nHere's a brief overview of the options:\n\nService principal: Provides a secure and scalable method for authenticating and authorizing access between Azure DevOps and other services. Ideal for automation and integration scenarios.\n\nMicrosoft Entra username and password: Less secure and not recommended for automated processes.\n\nManaged private endpoint: Used for secure, private connectivity between services, but not specifically for authentication in this context.\n\nWorkspace identity: Not typically used for cross-service API authentication in Azure DevOps integration scenarios.\n\nhttps://learn.microsoft.com/en-us/rest/api/fabric/core/deployment-pipelines/deploy-stage-content?tabs=HTTP\nThe above documentation shows that the deploy pipeline API can only use a service principal to deploy PowerBI content. Since we are deploying content related to a medallion architecture we will need to use user based authentication. \nWorkspace ID is for fabric to reach out to other things which isn't what we want. And a managed private-endpoint is not relevant.\n\nTo configure API authentication between Azure DevOps and Fabric, a service principal is the recommended approach. \n\nWorkspace identity: Workspace identities are a feature within Fabric itself. They are used to control access to resources within the Fabric workspace. While relevant for managing access within Fabric, they don't directly facilitate authentication with external services like Azure DevOps.\n\nSee https://learn.microsoft.com/en-us/answers/questions/2074603/run-pipeline-via-azure-function-by-rest-api\n\nAgree. Workspace identity is primarily designed for connecting Fabric items to storage accounts and is not the most suitable option for API authentication between Azure DevOps and Fabric.\n\nUse of service principal is discouraged",
  "question_type": "multiple_choice",
  "exam": "dp-700",
  "topic": 1,
  "question_number": 15,
  "url": "https://www.examtopics.com/discussions/microsoft/view/152676-exam-dp-700-topic-1-question-15-discussion/"
}