{
  "question_text": "HOTSPOT -<br/><br/>Case Study -<br/>This is a case study. Case studies are not timed separately. You can use as much exam time as you would like to complete each case. However, there may be additional case studies and sections on this exam. You must manage your time to ensure that you are able to complete all questions included on this exam in the time provided.<br/>To answer the questions included in a case study, you will need to reference information that is provided in the case study. Case studies might contain exhibits and other resources that provide more information about the scenario that is described in the case study. Each question is independent of the other questions in this case study.<br/>At the end of this case study, a review screen will appear. This screen allows you to review your answers and to make changes before you move to the next section of the exam. After you begin a new section, you cannot return to this section.<br/><br/><br/>To start the case study -<br/>To display the first question in this case study, click the Next button. Use the buttons in the left pane to explore the content of the case study before you answer the questions. Clicking these buttons displays information such as business requirements, existing environment, and problem statements. If the case study has an All Information tab, note that the information displayed is identical to the information displayed on the subsequent tabs. When you are ready to answer a question, click the Question button to return to the question.<br/><br/>Overview -<br/>Litware, Inc. is a publishing company that has an online bookstore and several retail bookstores worldwide. Litware also manages an online advertising business for the authors it represents.<br/>Existing Environment. Fabric Environment<br/>Litware has a Fabric workspace named Workspace1. High concurrency is enabled for Workspace1.<br/>The company has a data engineering team that uses Python for data processing.<br/>Existing Environment. Data Processing<br/>The retail bookstores send sales data at the end of each business day, while the online bookstore constantly provides logs and sales data to a central enterprise resource planning (ERP) system.<br/>Litware implements a medallion architecture by using the following three layers: bronze, silver, and gold. The sales data is ingested from the ERP system as Parquet files that land in the Files folder in a lakehouse. Notebooks are used to transform the files in a Delta table for the bronze and silver layers. The gold layer is in a warehouse that has V-Order disabled.<br/>Litware has image files of book covers in Azure Blob Storage. The files are loaded into the Files folder.<br/>Existing Environment. Sales Data<br/>Month-end sales data is processed on the first calendar day of each month. Data that is older than one month never changes.<br/>In the source system, the sales data refreshes every six hours starting at midnight each day.<br/>The sales data is captured in a Dataflow Gen1 dataflow. When the dataflow runs, new and historical data is captured. The dataflow captures the following fields of the source:<br/><br/>Sales Date -<br/><br/>Author -<br/><br/>Price -<br/><br/>Units -<br/><br/>SKU -<br/>A table named AuthorSales stores the sales data that relates to each author. The table contains a column named AuthorEmail. Authors authenticate to a guest Fabric tenant by using their email address.<br/>Existing Environment. Security Groups<br/>Litware has the following security groups:<br/><br/>Sales -<br/><br/>Fabric Admins -<br/><br/>Streaming Admins -<br/>Existing Environment. Performance Issues<br/>Business users perform ad-hoc queries against the warehouse. The business users indicate that reports against the warehouse sometimes run for two hours and fail to load as expected. Upon further investigation, the data engineering team receives the following error message when the reports fail to load: “The SQL query failed while running.”<br/>The data engineering team wants to debug the issue and find queries that cause more than one failure.<br/>When the authors have new book releases, there is often an increase in sales activity. This increase slows the data ingestion process.<br/>The company’s sales team reports that during the last month, the sales data has NOT been up-to-date when they arrive at work in the morning.<br/><br/>Requirements. Planned Changes -<br/>Litware recently signed a contract to receive book reviews. The provider of the reviews exposes the data in Amazon Simple Storage Service (Amazon S3) buckets.<br/>Litware plans to manage Search Engine Optimization (SEO) for the authors. The SEO data will be streamed from a REST API.<br/><br/>Requirements. Version Control -<br/>Litware plans to implement a version control solution in Fabric that will use GitHub integration and follow the principle of least privilege.<br/>Requirements. Governance Requirements<br/>To control data platform costs, the data platform must use only Fabric services and items. Additional Azure resources must NOT be provisioned.<br/><br/>Requirements. Data Requirements -<br/>Litware identifies the following data requirements:<br/>Process the SEO data in near-real-time (NRT).<br/>Make the book reviews available in the lakehouse without making a copy of the data.<br/>When a new book cover image arrives in the Files folder, process the image as soon as possible.<br/>You need to troubleshoot the ad-hoc query issue.<br/>How should you complete the statement? To answer, select the appropriate options in the answer area.<br/>NOTE: Each correct selection is worth one point.<br/><br/><img src=\"images/dp-700_topic-3_question-1_html_1.png\" title=\"image69\"/>",
  "question_images": [
    "images/dp-700_topic-3_question-1_question_1.png"
  ],
  "answers": {},
  "answer_images": {},
  "correct_answer": [],
  "correct_answer_images": [
    "images/dp-700_topic-3_question-1_correct_1.png"
  ],
  "discussion": "queryinsights.frequently_run_queries\n\nnumber_of_failed_runs > 1\n\nonly this table have the fields specified in the SELECT AND WHERE statements\n\nThe data engineering team wants to debug the issue and find queries that cause more than one failure.\n\nhttps://learn.microsoft.com/en-us/sql/relational-databases/system-views/queryinsights-frequently-run-queries-transact-sql?view=fabric&preserve-view=true\n\nTested\nSELECT  [last_run_start_time],[last_run_command],[last_run_total_elapsed_time_ms] \nFROM [Datawarehouse].[queryinsights].[frequently_run_queries]\nwhere [last_run_total_elapsed_time_ms]>7200000\nand [number_of_failed_runs]>1\n\nonly this view has all columns\n\nqueryinsights.long_running_queries\nD. number_of_failed_runs ≥ 1\n\nI tested in Fabric.\n\nqueryinsights.long_running_queries exposes last_run_start_time, last_run_command, last_run_total_elapsed_time_ms, and summary fields such as number_of_failed_runs.\n\nhttps://learn.microsoft.com/en-us/sql/relational-databases/system-views/queryinsights-long-running-queries-transact-sql?view=fabric\n\nyes but it does not have the column \"number_of_cancelled_runs\" needed for filtering\n\nqueryinsights.exec_requests_history\nnumber_of_failed_runs > 1\n\n•\tqueryinsights.frequently_run_queries\n\t•\tnumber_of_failed_runs > 1\n\nThe provided answer is incorrect. The correct query is:\n\nSELECT last_run_start_time, last_run_command\nFROM queryinsights.frequently_run_queries \nWHERE last_run_total_elapsed_time_ms > 7200000\n  AND number_of_failed_runs > 1;\n\nSELECT \n  last_run_start_time,\n  last_run_command\nFROM \n  queryinsights.long_running_queries\nWHERE \n  last_run_total_elapsed_time_ms > 7200000; -- two hours\n\nhttps://learn.microsoft.com/en-us/sql/relational-databases/system-views/queryinsights-long-running-queries-transact-sql?view=fabric\n\nSELECT \n  last_run_start_time,\n  last_run_command,\n  number_of_failed_runs\nFROM queryinsights.frequently_run_queries\nWHERE number_of_failed_runs > 1;\n\nProvided answers are correct.\nqueryinsights.frequently_run_queries\n\nlast_run_start_time\tdatetime2\tTime of the most recent query execution.\nlast_run_command\tvarchar(8000)\tText of the last query execution.\nnumber_of_runs\tint\tTotal number of times the query was executed.\navg_total_elapsed_time_ms\tint\tAverage query execution time (ms) across all runs.\nlast_run_total_elapsed_time_ms\tint\tTime taken by the last execution (ms).\nlast_dist_statement_id\tuniqueidentifier\tID linking the query to queryinsights.exec_requests_history.\nlast_run_session_id\tsmallint\tUser session ID for the last execution.\nmin_run_total_elapsed_time_ms\tint\tShortest query execution time (ms).\nmax_run_total_elapsed_time_ms\tint\tLongest query execution time (ms).\nnumber_of_successful_runs\tint\tNumber of successful query executions.\nnumber_of_failed_runs\tint\tNumber of failed query executions.\nnumber_of_cancelled_runs\tint\tNumber of canceled query executions.\n\nI'm sorry, the provided answer is wrong. It should be queryinsights.frequently_run_queries as explained above.",
  "question_type": "image_only",
  "exam": "dp-700",
  "topic": 3,
  "question_number": 1,
  "url": "https://www.examtopics.com/discussions/microsoft/view/154684-exam-dp-700-topic-3-question-1-discussion/"
}