{
  "question_text": "You have a Fabric workspace that contains a write-intensive warehouse named DW1. DW1 stores staging tables that are used to load a dimensional model. The tables are often read once, dropped, and then recreated to process new data.<br/><br/>You need to minimize the load time of DW1.<br/><br/>What should you do?",
  "question_images": [],
  "answers": {
    "A": "Enable V-Order.",
    "B": "Create statistics.",
    "C": "Drop statistics.",
    "D": "Disable V-Order."
  },
  "answer_images": {},
  "correct_answer": [
    "D"
  ],
  "correct_answer_images": [],
  "discussion": "Option A is wrong, V-Order is enabled by default, there wouldn’t be a need to enable it again, even if not enabled, In staging scenarios like this—where tables are short-lived, often read once, and then dropped—read performance is not critical. The focus is instead on minimizing. V-Order introduces an average of 15% overhead on write times, which can negatively impact scenarios where load time is the top priority.\n\nOption D is correct: you can avoid the write-time overhead associated with V-Order optimization, making it the most suitable choice for your requirements.\n\nfocus on minimizing load times instead of read performance\n\nDisabling V-Order can be useful for write-intensive warehouses, such as for warehouses that are dedicated to staging data as part of a data ingestion process. Staging tables are often dropped and recreated (or truncated) to process new data. These staging tables might then be read only once or twice, which might not justify the ingestion time added by applying V-Order. By disabling V-Order and reducing the time to ingest data, your overall time to process data during ingestion jobs might be reduced.\nhttps://learn.microsoft.com/en-us/fabric/data-warehouse/v-order\n\nA staging table is a temporary landing area where raw data is loaded before it’s transformed into your final dimensional model (fact/dim tables).\nIt’s not meant to be queried by end users.\nIt only exists to hold raw data temporarily, help you process it, and then be discarded.\nWhat “read once, dropped, recreated” means\nLoad raw data into staging table\nExample:\nCREATE TABLE Staging_Sales (...);\nINSERT INTO Staging_Sales VALUES (...); -- Load 1M rows\nThis loads data (say from CSVs, ERP, or API).\nRead the staging table once\nUse the data to transform & load into the dimensional model:\nINSERT INTO FactSales\nSELECT SaleDate, ProductID, SUM(SalesAmount)\nFROM Staging_Sales\nGROUP BY SaleDate, ProductID;\nHere, Staging_Sales is only read once during the ETL/ELT process.\nDrop the staging table\nAfter the load is finished, you remove the staging table:\nDROP TABLE Staging_Sales;\n\nWhen you disable V-Order, it affects the entire warehouse (all tables inside).\nin Microsoft exam questions, the canonical best practice for staging tables = drop statistics.\n\nD is correct\n\noption D but it affect all warehouses\n\nDisable V-Order - This avoids the write-time overhead of applying V-Order optimization\nPerfect for staging scenarios where:\nTables are short-lived\nRead performance is not the priority\nLoad time is more important\n\nWhy wouldn't A --> Enable V-Order be the correct answer?\n\nD is the correct answer\n\nwhy is that ?\n\nV-Order is a write time optimization, has a 15% impact on average write times, but results in an average of 10% faster read times, with some scenarios up to 50%. https://learn.microsoft.com/en-us/fabric/data-engineering/delta-optimization-and-v-order?tabs=sparksql",
  "question_type": "multiple_choice",
  "exam": "dp-700",
  "topic": 3,
  "question_number": 14,
  "url": "https://www.examtopics.com/discussions/microsoft/view/302447-exam-dp-700-topic-3-question-14-discussion/"
}