{
  "question_text": "You have an Azure Data Lake Storage Gen2 account named storage1 and an Amazon S3 bucket named storage2.<br/>You have the Delta Parquet files shown in the following table.<br/><img src=\"https://img.examtopics.com/dp-700/image9.png\" title=\"image10\"/><br/>You have a Fabric workspace named Workspace1 that has the cache for shortcuts enabled. Workspace1 contains a lakehouse named Lakehouse1. Lakehouse1 has the following shortcuts:<br/>A shortcut to ProductFile aliased as Products<br/>A shortcut to StoreFile aliased as Stores<br/>A shortcut to TripsFile aliased as Trips<br/>The data from which shortcuts will be retrieved from the cache?",
  "question_images": [
    "https://img.examtopics.com/dp-700/image9.png"
  ],
  "answers": {
    "A": "Trips and Stores only",
    "B": "Products and Store only",
    "C": "Stores only",
    "D": "Products only",
    "E": "Products, Stores, and Trips"
  },
  "answer_images": {},
  "correct_answer": [
    "C"
  ],
  "correct_answer_images": [],
  "discussion": "Shortcut caching is currently only supported for GCS, S3 and S3 compatible shortcuts.\n\n If a file hasn’t been accessed for more than 24 hrs it's purged from the cache. Individual files greater than 1 GB in size aren't cached\n\nhttps://learn.microsoft.com/en-us/fabric/onelake/onelake-shortcuts#caching\n\nThe retention period for cached files can be set from 1-28 days.\n(same link as obove)\n\nfor this reason is B\n\nADLS supports shortcuts, BUT the question is asking \"The data from which shortcuts will be retrieved FROM THE CACHE?\".\nADLS does NOT need a cache. -> Products is incorrect\n\nShortcuts are accessible from both ADLS and Amazon S3 as of the time of writing this answer. Trips is too large to be cached\n\nADLS supports shortcuts, BUT the question is asking \"The data from which shortcuts will be retrieved FROM THE CACHE?\".\nADLS does NOT need a cache. -> Products is incorrect\n\n02/09/2025.- Shortcut caching is currently supported for GCS, S3, S3 compatible, and on-premises data gateway shortcuts.\n\nAnswer: A — Trips and Stores only\n\nWhy: Fabric’s Cache for shortcuts currently caches data only for shortcuts that point to external cloud storage outside Azure (e.g., Amazon S3 and Google Cloud Storage). Shortcuts to Azure Data Lake Storage Gen2 (ADLS Gen2) are not cached.\n\nProductFile → storage1 (ADLS Gen2) → not cached\n\nTripsFile → storage2 (Amazon S3) → cached\n\nStoreFile → storage2 (Amazon S3) → cached\n\nSo reads from the cache will come from Trips and Stores only.\n\nIt is B because \n\n\"Shortcut caching is currently supported for GCS, S3, S3 compatible, and on-premises data gateway shortcuts.\"\n\nplease, read the notes in the documentation in the section Caching https://learn.microsoft.com/en-us/fabric/onelake/onelake-shortcuts#cache-shortcuts\n\nOnly the Products shortcut points to a file in ADLS Gen2, which is the only supported source for shortcut caching.\nTherefore, only Products will be retrieved from the cache.\n\nStores points to a file in Amazon S3, which does not support shortcut caching.\nSo even though the shortcut exists, data will not be retrieved from the cache.\n\n- Files must be under 1 GB to be eligible for caching.\n- Cached data is refreshed when accessed and expires after 24 hours of inactivity.\n- Caching applies to shortcuts in lakehouses with cache enabled.\n\nIt is C.\nADLS Gen2 is not supported:\nhttps://learn.microsoft.com/en-us/fabric/onelake/onelake-shortcuts#caching\nFiles > 1GB are not supported:\nhttps://learn.microsoft.com/en-us/fabric/onelake/onelake-shortcuts#caching\n\nBoth Amazon S3 and ADLS Gen2 are supported: \nhttps://community.fabric.microsoft.com/t5/Data-Engineering/Fabric-Shortcuts-and-Cache/m-p/4766667\nThere is no exact strict limit for the file size. So, the correct answer includes all the tables, i.e. \nE\n\nIt is B.\nThere is a limit for individual file size:\nhttps://learn.microsoft.com/en-us/fabric/onelake/onelake-shortcuts#caching\n\nIt is C.\nADLS Gen2 is not supported:\nhttps://learn.microsoft.com/en-us/fabric/onelake/onelake-shortcuts#caching\n\nFabric shortcut caching doesn’t support ADLS Gen2 because it’s already part of the Azure backbone, giving Fabric high-bandwidth native connectivity that makes local caching unnecessary.\n\n28/07/2025::: El período de retención de los archivos en caché se puede configurar entre 1 y 28 días. Cada vez que se accede al archivo, el período de retención se restablece. \nLos archivos individuales de más de 1 GB no se almacenan en caché.\nhttps://learn.microsoft.com/en-us/fabric/onelake/onelake-shortcuts#caching\n\nShortcut caching is currently supported for GCS, S3, S3 compatible, and on-premises data gateway shortcuts.\nhttps://learn.microsoft.com/en-us/fabric/onelake/onelake-shortcuts#caching\n\nLa respuesta correcta ACTUAL es B.\n1. El caché funciona tanto para orígenes de ADLS Gen2 como de Amazon S3\n2. Solo se almacenan en caché los archivos individuales con un tamaño superior a 1 GB\n\nShortcut caching is currently only supported for GCS, S3 and S3 compatible shortcuts.\n\nIf a file hasn’t been accessed for more than 24 hrs it's purged from the cache. Individual files greater than 1 GB in size aren't cached\n\nhttps://learn.microsoft.com/en-us/fabric/onelake/onelake-shortcuts#caching\n\nShortcut caching is currently only supported for GCS, S3 and S3 compatible shortcuts.\n\nIf a file hasn’t been accessed for more than 24 hrs it's purged from the cache. Individual files greater than 1 GB in size aren't cached\n\nADLS Shortcut Caching is still NOT supported as of today, so there is no way it can be B, since Products is an ADLS shortcut.... that does not support caching. There is no documentation to say otherwise, just the opposite.\n\nC is correct. \n-Shortcut caching is currently supported for Google Cloud Storage (GCS), Amazon S3, and S3-compatible storage.\n-Azure Data Lake Storage Gen2 (ADLS Gen2) does not require or use caching since it integrates natively with OneLake, so it is not cached.\n-Files larger than 1 GB are not cached.\n\nProductFile is in storage1 (Azure) → not cached.\n\nTripsFile is in storage2 (Amazon S3), but it's 2 GB, which is large → not cached.\n\nStoreFile is in storage2 (Amazon S3) and only 25 MB → likely to be cached.",
  "question_type": "multiple_choice",
  "source": "direct_html",
  "url": "https://www.examtopics.com/discussions/microsoft/view/152939-exam-dp-700-topic-1-question-18-discussion/",
  "topic": 1,
  "question_number": 18
}