{
  "question_text": "You have a Fabric workspace that contains a Real-Time Intelligence solution and an eventhouse.<br/>Users report that from OneLake file explorer, they cannot see the data from the eventhouse.<br/>You enable OneLake availability for the eventhouse.<br/>What will be copied to OneLake?",
  "question_images": [],
  "answers": {
    "A": "only data added to new databases that are added to the eventhouse",
    "B": "only the existing data in the eventhouse",
    "C": "no data",
    "D": "both new data and existing data in the eventhouse",
    "E": "only new data added to the eventhouse"
  },
  "answer_images": {},
  "correct_answer": [
    "D"
  ],
  "correct_answer_images": [],
  "discussion": "- Existing tables aren't affected. New tables are made available in OneLake.\n\nhttps://learn.microsoft.com/en-us/fabric/real-time-intelligence/event-house-onelake-availability#how-it-works\n\nAs per documentation, now you have option to select historical backfill. So I think question's verbiage is incomplete now. \nAnswer D : Seems more right answer now, because you have this option and may be it was selected while making the One Lake Availability.\n\nIt is still E.\n\nYou can turn on OneLake availability at the database or table level. When enabled at the database level, all new tables and their data are made available in OneLake. When turning on the feature, <<<you can also choose to apply this option to existing tables by selecting the Apply to existing tables option, to include historic backfill>>>. Turning on at the table level makes only that table and its data available in OneLake\n\nOnly if the question mentions explicitly together the \"Apply to existing tables option\", otherwise, only \"enable OneLake availability\" does not do the backfill.\n\nagreed with answer E after reading and evaluating the article carefully.\n\nWhen you enable OneLake availability for an eventhouse in Microsoft Fabric, only new data ingested into the eventhouse will be synced and made available in OneLake.\n\nWhen enable OneLake availability for an Eventhouse, NOTHING is copied automatically.\nSimply enabling OneLake availability does not copy any data at all. A new real-time connection is created that streams future ingestions into OneLake and only after new data would be visible\n\nAction\tWhat Happens?\nEnable OneLake availability\tShortcut created\nExisting data copied?\t❌ No\nNew data copied?\t❌ No\nData remains in eventhouse?\t✅ Yes\n\nThe question should be clear.\n\nit only creates a shortcut. no acutal data copied\n\nI did that in real time and it is everything - past and new data.\n\nD - enabling OneLake availability for an eventhouse copies both the existing data and continuously ingested new data to OneLake, making the full dataset accessible.\n\nMicrosoft’s current docs say when you turn on OneLake availability for an eventhouse (KQL database), you can apply it to existing tables to include historic backfill, and once enabled it continues to sync new data as it arrives. So users will see both the historical data and ongoing new data in OneLake. Microsoft Learn\n\n\n“When enabled at the database level… you can also choose to apply this option to existing tables, to include historic backfill.” Microsoft Learn\n\n\n“When you turn availability back on, all data is made available in OneLake, including historic backfill.” Microsoft Learn\n\n\n\nNote: Earlier guidance (pre-2025) often said “only new data” with no backfill. The behavior has since changed/been clarified in the official docs.\n\nWhen you enable OneLake availability for an eventhouse, both new and existing data in the eventhouse will be copied to OneLake. This feature ensures that data, whether newly ingested or already present, becomes available for access through OneLake, making it easier for users to interact with and explore the data directly from OneLake file explorer.\n\nEarlier behavior (Preview phase, mid-2024)\n\nWhen OneLake availability for Eventhouse was first introduced,\nonly new data ingested after enabling the feature was written to OneLake.\nExisting data remained in Kusto storage unless re-ingested or exported manually.\n\nThat’s why older documentation (and many early exam questions) listed\nE. only new data added to the eventhouse as the correct answer.                                                     Current behavior (GA – 2025 update)\n\nPer the Microsoft Fabric Real-Time Intelligence documentation, when you enable OneLake availability on an Eventhouse now:\n\n“When OneLake availability is turned on, existing data in the Eventhouse and any new data ingested afterward is made available in OneLake in Delta format.”\nSo now:\n\nExisting data is copied and made visible in OneLake.\nNew data continues to sync automatically going forward.\n\nYou have the possibility to choose existing data, but only by enabling the option to include this, the data is not presented automatically and as the statement does not mention \"possibility\", the final answer is E.\n\nWhen you enable OneLake availability for an eventhouse, both the existing data withini the eventhouse and any new data subsequently added to it will be copied to OneLake. This ensures that the eventhouse data is acceble through OneLake file explorer for users who previously couldn't see it.\n\nI am going with D, as many have mentioned you can enable it to copy the existing data. The question is... is the question old and the question text just not updated OR are they truly trying to trick you... for anyone who has taken the test recently is the content updated to say you selected the option to include existing data?\n\nE is Correct.\nQuestion says : User cannot see the data from the eventhouse.\nIf OneLake Availablilty is enavled, only New Tables are made available. Also no mention of whether the option : Apply to exisiting Table is checked, and also Users cannot see data, meaning Users cannot see Old data, as only new Tables appear\n\nhttps://learn.microsoft.com/en-us/fabric/real-time-intelligence/event-house-onelake-availability#how-it-works\n\nBest thing to check the answers is to use Microsoft Copilot\nCopilot says \nWhen you enable OneLake availability for an eventhouse in Microsoft Fabric, the platform copies both existing and newly ingested data into the OneLake-backed file storage. This ensures that users can access all relevant telemetry data—past and present—through tools like the OneLake file explorer or other storage-compatible interfaces.\n\nThis is particularly helpful when enabling lake-centric analytics or blending real-time and historical data into broader lakehouse or warehouse solutions.\n\nDidn't you realize yet. Copilot and ChatGPT will always give you a \"Yes\" answer. Even if it is not a full answer. Because yes it is possible, but not just enabling availability.\n\nThis explains why both new and existing data will be copied to OneLake.\nCheck this link:\n\nhttps://learn.microsoft.com/en-us/fabric/real-time-intelligence/event-house-onelake-availability#how-it-works\n\nAlso chatbot says:\nWhen you enable OneLake availability for an eventhouse in Microsoft Fabric:\n\nExisting data in the eventhouse becomes immediately available in OneLake.\n\nNew data added to the eventhouse is also automatically streamed and accessible via OneLake moving forward.\n\nThis allows users to access both historical and real-time streaming data through OneLake interfaces, including the OneLake file explorer.",
  "question_type": "multiple_choice",
  "source": "direct_html",
  "url": "https://www.examtopics.com/discussions/microsoft/view/152690-exam-dp-700-topic-1-question-14-discussion/",
  "topic": 1,
  "question_number": 14
}