{
  "question_text": "You have a Fabric deployment pipeline that uses three workspaces named Dev, Test, and Prod.<br/><br/>You need to deploy an Eventhouse as part of the deployment process.<br/><br/>What should you use to add the Eventhouse to the deployment process?",
  "question_images": [],
  "answers": {
    "A": "an Azure DevOps pipeline",
    "B": "an eventstream",
    "C": "GitHub Actions"
  },
  "answer_images": {},
  "correct_answer": [
    "A"
  ],
  "correct_answer_images": [],
  "discussion": "the Eventhouse isn’t a supported item in Fabric deployment pipelines. To include it in your Dev → Test → Prod process you need to automate it outside the built-in deployment pipeline, e.g., by calling the Fabric REST APIs during CI/CD.\n\nIt might be the details in the question are not correct.\nBut since Deployment Pipelines do not copy data, the Eventhouse will have the table schemas but no rows of data. An associated Eventstream will be required to run and populate the data in the eventhosue. With the implication being a blank eventhouse has no value.\n\nGuys, It is missing answers. Deployment Pipelines supports EventHouses. https://learn.microsoft.com/en-us/fabric/cicd/deployment-pipelines/intro-to-deployment-pipelines?tabs=new-ui#supported-items\n\nhttps://learn.microsoft.com/en-us/fabric/cicd/deployment-pipelines/intro-to-deployment-pipelines?tabs=new-ui#:~:text=Real%2Dtime%20Intelligence%20items%3A\n\nAn Item should be added to a Fabric Deployment Pipeline. So the only choice is B.\n\nThe correct answer is A as DevOps is dedicated to control creation and deployment of fabric item through script, api and rules. \n\nB is false because the evenstream is a current association with the eventhouse but is not linked to any direct deployment control ability.\n\nI originally thought B and this was how ChatGPT explained it\n\n\nIn Microsoft Fabric, Eventhouses are used to store and analyze real-time event data. However, you can't directly add an Eventhouse to a deployment pipeline (like you can with Lakehouses, Dataflows, or Reports). Instead, you deploy and manage Eventhouses through Eventstreams, which serve as the ingestion and routing layer for events.\n\nAn eventstream is the only unique choice and is used with an Eventhouse\n\nPipeline boys!\n\nI believe it is also B, although like most, this is a silly worded answer.\n\nWhy not others\nA. Azure DevOps pipeline: While useful for CI/CD, it doesn't natively manage Fabric-specific components like Eventhouse.\nC. GitHub Actions: Similar to Azure DevOps, it's a general-purpose automation tool, not specific to Fabric's real-time data infrastructure.\n\nTo deploy an Eventhouse as part of your Fabric deployment pipeline, you should use an eventstream. This is the supported method within Fabric's deployment pipeline for adding and managing Eventhouse components across Dev, Test, and Prod workspaces. External tools like Azure DevOps pipelines or GitHub Actions are not designed to natively handle Fabric’s metadata and dependencies for Eventhouse, and relying solely on them can lead to broken relationships and inconsistent deployments\n\nNote: Dev, Test and Prod are not environments they were called as Workspaces. Don't get confused there\n\nTo automate deployment of such components across multiple Fabric workspaces (Dev → Test → Prod), you'd use deployment automation tools like Azure DevOps pipelines .\n\nAzure DevOps pipeline and GitHub Actions are both CICD tools. An eventstream is the only unique choice and is used with an Eventhouse\n\nDevops Pipeline",
  "question_type": "multiple_choice",
  "source": "direct_html",
  "url": "https://www.examtopics.com/discussions/microsoft/view/304638-exam-dp-700-topic-1-question-56-discussion/",
  "topic": 1,
  "question_number": 56
}