{
  "question_text": "You have a Google Cloud Storage (GCS) container named storage1 that contains the files shown in the following table.<br/><img src=\"https://img.examtopics.com/dp-700/image7.png\" title=\"image8\"/><br/>You have a Fabric workspace named Workspace1 that has the cache for shortcuts enabled. Workspace1 contains a lakehouse named Lakehouse1. Lakehouse1 has the shortcuts shown in the following table.<br/><img src=\"https://img.examtopics.com/dp-700/image8.png\" title=\"image9\"/><br/>You need to read data from all the shortcuts.<br/>Which shortcuts will retrieve data from the cache?",
  "question_images": [
    "https://img.examtopics.com/dp-700/image7.png",
    "https://img.examtopics.com/dp-700/image8.png"
  ],
  "answers": {
    "A": "Stores only",
    "B": "Products only",
    "C": "Stores and Products only",
    "D": "Products, Stores, and Trips",
    "E": "Trips only",
    "F": "Products and Trips only"
  },
  "answer_images": {},
  "correct_answer": [
    "D"
  ],
  "correct_answer_images": [],
  "discussion": "Shortcut caching can be used to reduce egress costs associated with cross-cloud data access. As files are read through an external shortcut, the files are stored in a cache for the Fabric workspace. Subsequent read requests are served from cache rather than the remote storage provider. Cached files have a retention period of 24 hours.\n\nhttps://learn.microsoft.com/en-us/fabric/onelake/onelake-shortcuts#caching\n\nAnswer should be B, as ADLS shortcuts are supported as well as gcb, s3. But cap is 1gb.\n\nMy bad this is answer for 18. Here it should be all 3. As all of them are less than 2 gb and 28 days is now max retention.\n\nI mean 1gb, stupid typo\n\ncaching can now be retained up to 28 days\n\nFabric only supports shortcut caching when Fabric can convert the source into Delta.\n\nAnswer: C — Stores and Products only\n\nWhy: With Cache for shortcuts enabled, Fabric serves data from cache only if the shortcut was accessed within the last 24 hours.\n\nProducts → last accessed 12 hours ago → cached\n\nStores → last accessed 4 hours ago → cached\n\nTrips → last accessed 48 hours ago → cache expired → reads from source, not cache\n\nTherefore, only Stores and Products will be retrieved from the cache.\n\nThe retention period for cached files can be set from 1-28 days.\nhttps://learn.microsoft.com/en-us/fabric/onelake/onelake-shortcuts\n\nAs nothing has been explicitly stated regarding cache retention period, one can assume it is still the default value of 1 day. \nHence, cache retention of 24 hours has been expired for Trips and it will be read from source again.\n\nFrom doc page: \nShortcut caching can reduce egress costs associated with cross-cloud data access. As files are read through an external shortcut, the files are stored in a cache for the Fabric workspace. Subsequent read requests are served from cache rather than the remote storage provider. The retention period for cached files can be set from 1-28 days. Each time the file is accessed, the retention period is reset. If the file in remote storage provider is more recent than the file in the cache, the request is served from remote storage provider and the updated file will then be stored in cache. If a file hasn’t been accessed for more than the selected retention period, it's purged from the cache. Individual files greater than 1 GB in size aren't cached.\n\nI think that C and D are correct, but in the statement they don´t say anything about retention period in days, and there´s no default retention period in fabric, so it´s could be one day (24 hours).\nSo I think that C in this context is more correct.\n\nC \n\nTrips is 48 old\n\nFiles less than 1GB and retention is now up to 28 days\n\nCached files have a retention period of 24 hours.\n\n24 hour limit\n\nCache is now 28 days\n\nIt depends when you asked this question, right now, as of (not today exactly) but as I write this, D would be correct as the cache is in days (28ish), not 12 or 24 hours anymore.\n\nD: Cache duration can now be configured between 1 and 28 days, not just the default 24 hours, but files larger than 1 GB are excluded from the cache and will not be cached.\n\nCaching is for 1-28 days on last accessed and the individual files are less than 1GB each\n\nHere the default retention period is 24 hours, but can be configured to 1-28 days. But, they didn't mention about any retention period. Hence, default retention period is applied and option C is the correct\n\nD: he retention period for cached files can be set from 1-28 days Files are less than 1gb all sources type are supported",
  "question_type": "multiple_choice",
  "source": "direct_html",
  "url": "https://www.examtopics.com/discussions/microsoft/view/152675-exam-dp-700-topic-1-question-16-discussion/",
  "topic": 1,
  "question_number": 16
}