{
  "question_text": "HOTSPOT -<br/>You have a Fabric workspace named Workspace1_DEV that contains the following items:<br/>10 reports<br/><br/>Four notebooks -<br/><br/>Three lakehouses -<br/><br/>Two data pipelines -<br/><br/>Two Dataflow Gen1 dataflows -<br/><br/>Three Dataflow Gen2 dataflows -<br/>Five semantic models that each has a scheduled refresh policy<br/>You create a deployment pipeline named Pipeline1 to move items from Workspace1_DEV to a new workspace named Workspace1_TEST.<br/>You deploy all the items from Workspace1_DEV to Workspace1_TEST.<br/>For each of the following statements, select Yes if the statement is true. Otherwise, select No.<br/><br/>NOTE: Each correct selection is worth one point.<br/><img src=\"https://img.examtopics.com/dp-700/image5.png\" title=\"image6\"/>",
  "question_images": [
    "https://img.examtopics.com/dp-700/image5.png"
  ],
  "answers": {},
  "answer_images": {},
  "correct_answer": [],
  "correct_answer_images": [
    "https://img.examtopics.com/dp-700/image6.png"
  ],
  "discussion": "NO: only metadata will be deployed to the target starge (https://learn.microsoft.com/en-us/fabric/cicd/deployment-pipelines/understand-the-deployment-process?tabs=new#item-properties-copied-during-deployment)\n\nYES: Gen1 dataflows will be deployed\n\nNO: Refresh schedules will not be deployed (https://learn.microsoft.com/en-us/fabric/cicd/deployment-pipelines/understand-the-deployment-process?tabs=new#item-properties-copied-during-deployment)\n\nGen1 is not in the list of the supported items:\nhttps://learn.microsoft.com/en-us/fabric/cicd/deployment-pipelines/intro-to-deployment-pipelines?tabs=new-ui#supported-items\n\nNo\nNo\nYes\n\nN Y N\nGen 1 dataflows will indeed be deployed: https://learn.microsoft.com/en-us/fabric/cicd/deployment-pipelines/create-rules?utm_source=chatgpt.com&tabs=new-ui\n\nData from the semantic models will be deployed to the target stage.\nNo – The data itself is not deployed. Only the structure/definition (metadata) of the semantic model is deployed. You'll need to refresh the model in the target stage to populate it with data.\n\nThe Dataflow Gen1 dataflows will be deployed to the target stage.\nNo – Only Dataflow Gen2 is supported in Microsoft Fabric deployment pipelines. Gen1 dataflows are not deployable through Fabric pipelines.\n\nThe scheduled refresh policies will be deployed to the target stage.\nNo – Scheduled refresh settings are not included in deployments. You must configure them separately in the target workspace.\n\nNo, Yes, No\nI have pipelines and they do deploy Gen1 Dataflows :)\njokes apart, Indeed Dataflows Gen 1 are supported with deployment pipelines. Only problem you need to configure the gateways and migrate connections and schedules and creds also.\n\nA. No. Data will not be transported \nB/C. Somehow a trick question in the sense, that (what I get from the documentation)\nB: Dataflow Gen1 will be cloned, but don't have really deployment support, so I would say No\nC: Refresh schedules are copied, but not activated, so I would again say No\n\nN, Y, N\nGen1 flows are supported, just have to fix potential other things (connections etc)\n\nAnswer\n1) No\n2) No\n3) Yes\n\nHere’s how each statement holds up in the context of Microsoft Fabric deployment pipelines:\n\n1) Data from the semantic models will be deployed to the target stage → No \nOnly the metadata (definition) of the semantic models is deployed. The actual data is not copied—you’ll need to refresh the models in the target workspace after deployment.\n\n2) The Dataflow Gen1 dataflows will be deployed to the target stage → No \nDataflow Gen1 is not supported in Fabric deployment pipelines. Only Dataflow Gen2 items are deployable.\n3) The scheduled refresh policies will be deployed to the target stage → Yes \nScheduled refresh settings for semantic models are included in the deployment and will be carried over to the target stage\n\nStatement 1: Data from the semantic models will be deployed to the target stage.\n\n❌ No\n\t•\tExplanation: Deployment pipelines do not deploy data from semantic models. Only the metadata (like tables, measures, and relationships) is deployed. Data must be refreshed in the target workspace after deployment.\n\n⸻\n\nStatement 2: The Dataflow Gen1 dataflows will be deployed to the target stage.\n\n❌ No\n\t•\tExplanation: Dataflow Gen1 items are not supported by Fabric deployment pipelines. Only Dataflow Gen2 is supported. Gen1 must be recreated or migrated manually.\n\n⸻\n\nStatement 3: The scheduled refresh policies will be deployed to the target stage.\n\n❌ No\n\t•\tExplanation: Scheduled refresh policies are not carried over in deployment pipelines. You must manually configure the refresh schedules in the target workspace after deploying.\n\n1 -> NO, only metadata are deployed\n2 -> NO, dataflow GEN1 are not supported by deployment pipelines\n3 -> NO, Refresh schedules are semantic model object attributes that are not deployed by deployment pipelines\n\nNo, Yes, No\n\nNo/No/No\n\n1.The following item properties aren't copied during deployment:\nData - Data isn't copied. Only metadata is copied\n\n2.When you deploy content from one pipeline stage to another, the copied content can contain the following items:\n\nData Engineering items:\n\nEnvironment\nGraphQL (preview)\nLakehouse (preview)\nNotebook\nSpark Job Definitions (preview)\nUser Data Functions (preview)\nData Factory items:\n\nCopy Job (preview)\nDataflows gen2\n\n3.The following semantic model properties are also not copied during deployment:\n\nRole assignment\n\nRefresh schedule\n\nhttps://learn.microsoft.com/en-us/fabric/cicd/deployment-pipelines/understand-the-deployment-process?tabs=new-ui#item-properties-that-are-not-copied\n\nhttps://learn.microsoft.com/en-us/fabric/cicd/deployment-pipelines/intro-to-deployment-pipelines?tabs=new-ui#supported-items\n\nNo, Yes, No\n\nItem properties copied during deployment\n1.Data sources (deployment rules are supported)\n2.Parameters (deployment rules are supported)\n3.Report visuals\n4.Report pages\n5.Dashboard tiles\n6.Model metadata\n7.Item relationships\n8.Sensitivity labels\n\nItem properties that are not copied\n1.Data - Data isn't copied. Only metadata is copied\n2.URL\n3.ID\n4.Permissions - For a workspace or a specific item\n5.Workspace settings - Each stage has its own workspace\n6.App content and settings - To update your apps, see Update content to Power BI apps\n7.Personal bookmarks\n8.The following semantic model properties are also not copied during deployment:\n9.Role assignment\n10.Refresh schedule\n11.Data source credentials\n12.Query caching settings (can be inherited from the capacity)\n13.Endorsement settings\n\nLink-https://learn.microsoft.com/en-us/fabric/cicd/deployment-pipelines/understand-the-deployment-process?tabs=new-ui\n\nNo Yes Yes\n\ndata from semantic models will be deployed in target: No. Deployment pipelines deploy the metadata of semantic models (datasets), not the actual data. The data in the target workspace will depend on the data sources configured for those semantic models and will need to be refreshed in the target environment.\n\ndata flow gen1 will be deployed in target: Yes. Dataflow Gen1 dataflows are deployed as part of the pipeline. Their definition and query logic will be moved to the target workspace. However, similar to semantic models, the data they process will be refreshed based on the target environment's data sources and refresh configurations.\n\nscheduled refresh policy will be deployed in target: Yes. The scheduled refresh policy configured for the semantic models in the source workspace is typically deployed along with the semantic model metadata to the target workspace. You should verify the schedule in the target environment after deployment.\n\nNo/NO/NO\nItem properties that are not copied\nThe following item properties aren't copied during deployment:\nData - Data isn't copied. Only metadata is copied\nURL\nID\nPermissions - For a workspace or a specific item\nWorkspace settings - Each stage has its own workspace\nApp content and settings - To update your apps, see Update content to Power BI apps\nPersonal bookmarks\nThe following semantic model properties are also not copied during deployment:\nRole assignment\nRefresh schedule\nData source credentials\nQuery caching settings (can be inherited from the capacity)\nEndorsement settings\nIncremental refresh settings aren't copied in Gen 1.\n\nYes/Yes/No\n\nNo/Yes/No\n\nNo/No/No\n\nDeployment pipelines do not support Dataflow Gen1 dataflows. These need to be manually migrated or recreated in the target stage. Only Dataflow Gen2 is supported in deployment pipelines.\n\nI believe Dataflow Gen1 is supported (aka Power BI Dataflows) , see https://learn.microsoft.com/en-us/fabric/cicd/deployment-pipelines/intro-to-deployment-pipelines?tabs=new#supported-items\n\nGHill is correct. Power BI dataflows are listed in the first link. And here it is called Dataflow Gen1: https://learn.microsoft.com/en-us/fabric/data-factory/dataflows-gen2-overview\n\nNO sorry again. I misread. The first question is - is DATA from semantic model copied. It is not. GHill is correct after all: https://learn.microsoft.com/en-us/fabric/cicd/deployment-pipelines/understand-the-deployment-process?tabs=new-ui#assign-a-workspace-to-an-empty-stage",
  "question_type": "image_only",
  "source": "direct_html",
  "url": "https://www.examtopics.com/discussions/microsoft/view/153078-exam-dp-700-topic-1-question-11-discussion/",
  "topic": 1,
  "question_number": 11
}