{
  "question_text": "You have a Fabric workspace named Workspace1 that contains a warehouse named DW1 and a data pipeline named Pipeline1.<br/>You plan to add a user named User3 to Workspace1.<br/>You need to ensure that User3 can perform the following actions:<br/>View all the items in Workspace1.<br/>Update the tables in DW1.<br/>The solution must follow the principle of least privilege.<br/>You already assigned the appropriate object-level permissions to DW1.<br/>Which workspace role should you assign to User3?",
  "question_images": [],
  "answers": {
    "A": "Admin",
    "B": "Member",
    "C": "Viewer",
    "D": "Contributor"
  },
  "answer_images": {},
  "correct_answer": [
    "D"
  ],
  "correct_answer_images": [],
  "discussion": "Viewer                  - Can view all content in the workspace, but can't modify it.\nContributor         - Can view and modify all content in the workspace.\nMember              -  Can view, modify, and share all content in the workspace.          Can add Members\nAdmin                   - Can view, modify, share, and manage all content in the workspace, including managing permissions. \n                                - Can add Admins, Members and can delete workspace.\n\nSo Contributor is the least role who can view and update the tables (modify the content).\n\nTo clear everyone's doubt , even if user have warehouse object level access only contributor role can provide modify permission in warehouse\n\nOnly member or above can modify warehouse items\n\nhttps://learn.microsoft.com/en-us/fabric/get-started/roles-workspaces\n\nAs I understand, the explain \"Create or modify warehouse items.\" in this document means member role can create and modify warehouse. If you check Microsoft documents for item level permission, they all said item on high level, such as lakehouse, warehouse. Item doesn't mean objects inside warehouse. Contributor role can update table data inside warehouse.\n\nViewer access at workspace level.\nIn the warehouse (OLS) - sql query: Granted UPDATE, INSERT access on table level to \"user-email\"\nResult: User able to update (insert) values to respective table.\n\nAccording to these words from Question \n\"You already assigned the appropriate object-level permissions to DW1.\"\n(this seems tricky part of the question)\nC. Viewer\n\n“You already assigned the appropriate object-level permissions to DW1”\n\nchanges everything.\n\nObject-level permissions on DW1 override workspace-level edit restrictions.\n\nA Viewer role on the workspace allows the user to see all workspace items,\nwhile the object-level permissions on DW1 allow them to update data in the warehouse.\n\nTherefore, granting Contributor or higher would violate least privilege, since those roles allow editing other workspace items.\n\nThe Key phrase here is: \"You already assigned the appropriate object-level permissions to DW1\". So Viewer in Workspace is enought.\n\nYou would think that SQL Granular Permissions would work even for a viewer workspace role, like in the case of Synpase I believe, but here Fabric won't allow an UPDATE statement for a viewer.\n\nA Contributor can view all items in a Fabric workspace and interact with specific objects—like updating tables—as long as they already have object-level permissions.\n\nSince you’ve already given User3 the necessary object-level permissions on DW1, this role grants just enough access without overstepping boundaries. Perfect alignment with the principle of least privilege.\n\nContributor es el mínimo rol que permite ver y modificar (si ya tiene los permisos necesarios a nivel de objeto)\n\nIt is not clear, that they actually were given the Object level permissions at the Workspace level, again another unclear detail in the question imho. So I am going to go with contributor.\n\nD is correct\n\nView all the items in Workspace1.\nUpdate the tables in DW1. \nYou already assigned the appropriate object-level permissions to DW1.\n\nContributor  Can view and modify all content in the workspace. So it is higer option]\nViewer + object-level is  enough\n\nViewer + permisos a nivel objeto: solo puede consultar, no puede modificar.\n\nas per this doc, contributor can create and modify warehouse item : https://learn.microsoft.com/en-us/fabric/fundamentals/roles-workspaces\n\nExplanation:\nYou need to ensure that User3 can:\n\nView all items in the workspace\n\nUpdate tables in DW1\n\nFollow the principle of least privilege\n\nRoles breakdown:\nAdmin: Too much access (can delete, manage roles, settings, etc.)\n\nMember: Also more permissions than needed (can publish and manage content broadly)\n\nViewer: Read-only — cannot update DW1\n\n✅ Contributor:\n\nCan view all items\n\nCan edit datasets, dataflows, pipelines, and warehouses (if object-level permissions are granted)\n\nFits the least privilege principle\n\nContributor role\n\nThe Viewer role allows a user to:\nSee all items in the workspace\nCannot open notebooks or pipelines\nCannot run queries or update data, even if object-level permissions are granted\nViewer role is strictly read-only at the workspace level, regardless of object-level permissions.\n\nWhy Contributor is correct:\nCan view all items in the workspace\nCan interact with items (like run pipelines, notebooks)\nWith object-level permissions, can update data in DW1\nDoes not have management privileges (unlike Member or Admin)\nContributor + object-level permissions = just enough rights to view and update without overreaching — perfect for least privilege.\n\nthey already have access to DW1",
  "question_type": "multiple_choice",
  "source": "direct_html",
  "url": "https://www.examtopics.com/discussions/microsoft/view/152941-exam-dp-700-topic-1-question-21-discussion/",
  "topic": 1,
  "question_number": 21
}