{
  "question_text": "HOTSPOT<br/> -<br/><br/>You have a Fabric warehouse named DW1 that contains four staging tables named ProductCategory, ProductSubcategory, Product, and SalesOrder. ProductCategory, ProductSubcategory, and Product are used often in analytical queries.<br/><br/>You need to implement a star schema for DW1. The solution must minimize development effort.<br/><br/>Which design approach should you use? To answer, select the appropriate options in the answer area.<br/><br/>NOTE: Each correct selection is worth one point.<br/><br/><img src=\"https://img.examtopics.com/dp-700/image81.png\"/>",
  "question_images": [
    "https://img.examtopics.com/dp-700/image81.png"
  ],
  "answers": {},
  "answer_images": {},
  "correct_answer": [],
  "correct_answer_images": [
    "https://img.examtopics.com/dp-700/image82.png"
  ],
  "discussion": "second one should be \"The unique system generated identifier\"\n\n2. The joining key must be:\n✅ The unique system generated identifier\n\nWhy?\nData integrity: Use ProductID (or similar surrogate key) as the primary key for the product dimension table.\n\nEfficient joins: Surrogate keys improve join performance between fact and dimension tables.\n\nWhy Not Other Options?\nProduct name/date: Names can change, and dates are not unique.\n\nProduct category name: Not a stable or unique identifier.\n\nProductCategory, ProductSubcategory and Product must be: Denormalized into a single product dimension table\nThe joining key must be: The unique system generated identifier\n\nDenormalized into a single product dimension table\nThe unique system-generated identifier\n\nsingle table, system generated id\n\nRequest is minimize effort with start schema:\n1: combine in one products table\n2: ProductID\n\nThe unique system generated identifier",
  "question_type": "image_only",
  "source": "direct_html",
  "url": "https://www.examtopics.com/discussions/microsoft/view/302494-exam-dp-700-topic-2-question-24-discussion/",
  "topic": 2,
  "question_number": 24
}