{
  "question_text": "You have a Fabric workspace named Workspace1 that contains a lakehouse named Lakehouse1. Lakehouse1 contains the following tables:<br/><br/>Orders -<br/><br/>Customer -<br/><br/>Employee -<br/>The Employee table contains Personally Identifiable Information (PII).<br/>A data engineer is building a workflow that requires writing data to the Customer table, however, the user does NOT have the elevated permissions required to view the contents of the Employee table.<br/>You need to ensure that the data engineer can write data to the Customer table without reading data from the Employee table.<br/>Which three actions should you perform? Each correct answer presents part of the solution.<br/>NOTE: Each correct selection is worth one point.",
  "question_images": [],
  "answers": {
    "A": "Share Lakehouse1 with the data engineer.",
    "B": "Assign the data engineer the Contributor role for Workspace2.",
    "C": "Assign the data engineer the Viewer role for Workspace2.",
    "D": "Assign the data engineer the Contributor role for Workspace1.",
    "E": "Migrate the Employee table from Lakehouse1 to Lakehouse2.",
    "F": "Create a new workspace named Workspace2 that contains a new lakehouse named Lakehouse2.",
    "G": "Assign the data engineer the Viewer role for Workspace1."
  },
  "answer_images": {},
  "correct_answer": [
    "D",
    "E",
    "F"
  ],
  "correct_answer_images": [],
  "discussion": "First we need to do F and E to separate the Employee table from the other tables. Then they need contributor access to be able to write to the Customer table which is in Workspace1\n\n\nA is incorrect as sharing only gives read access. https://learn.microsoft.com/en-us/fabric/data-engineering/lakehouse-sharing\nB is incorrect as Workspace2 has the Employee table which the data engineer shouldn’t access.\nC is incorrect as viewer won’t allow them to write and the Customer table isn’t even in that workspace\nE is incorrect as viewer won’t allow them to write\n\nAssign the data engineer the Contributor role for Workspace1 ( D) \n- This will provide the necessary permissions to write to the Customer table.\nMigrate the Employee table from Lakehouse1 to Lakehouse2 (E) \n- This will isolate the table with PII in a different lakehouse.\nCreate a new workspace named Workspace2 that contains a new lakehouse named Lakehouse2 (Option F) \n- This is necessary to separate the Employee table into a different workspace to restrict access.\n\nSeparate the PII table from the lakehouse the engineer will use.\n\nF. Create a new workspace named Workspace2 that contains a new lakehouse named Lakehouse2.\n\nE. Migrate the Employee table from Lakehouse1 to Lakehouse2.\nOnly users who need PII access are given permissions to Workspace2/Lakehouse2.\n\nGive the engineer write access only where Customer lives.\n\nD. Assign the data engineer the Contributor role for Workspace1.\nThis lets them write to the Customer table (and Orders) in Lakehouse1, while they have no access to Workspace2/Lakehouse2 and therefore cannot read Employee.\n\nSo the correct actions are: D, E, and F.\n\nAs per chatGPT\n\nI wouldn't rely on that... It is 50/50...\n\nSolution Steps:\nIsolate sensitive data:\nCreate a new workspace (Workspace2) with a new lakehouse (Lakehouse2) to host the PII data separately.\n→ F. Create a new workspace named Workspace2 that contains a new lakehouse named Lakehouse2.\n\nMove PII data:\nMigrate the Employee table (PII) from Lakehouse1 to Lakehouse2 to remove it from the original environment.\n→ E. Migrate the Employee table from Lakehouse1 to Lakehouse2.\n\nGrant minimal write permissions:\nAssign the Contributor role for Workspace1 to the data engineer. This role allows writing to objects (like the Customer table) but does not grant access to Workspace2 (where PII resides).\n→ D. Assign the data engineer the Contributor role for Workspace1.\n\n✅ D. Assign the data engineer the Contributor role for Workspace1\n\nContributor role is required to write data to tables in the workspace, including Customer. This role allows adding or editing content but not managing access or seeing hidden data like Employee if it’s secured separately.\n\n✅ E. Migrate the Employee table from Lakehouse1 to Lakehouse2\n\nSince the Employee table contains PII, and the engineer should not have access to it, moving it to a separate lakehouse ensures isolation of sensitive data, while still allowing access to Customer in Lakehouse1.\nF. Create a new workspace named Workspace2 that contains a new lakehouse named Lakehouse2\n\nCorrect DEF\n\nFED: \nCreate a new workspace and lakehouse (Workspace2 and Lakehouse2).\nMigrate the Employee table to the new lakehouse.\nAssign the data engineer the Contributor role in the original workspace.\n\ncon esto los ingenieros no pueden ver ni escribir los datos PII\n\nThe order is F---E---D.\n\nA. Share Lakehouse1 with the data engineer\nThis gives the data engineer access to the lakehouse so they can interact with its tables.\nSharing is required before any role-based permissions can be applied.\n D. Assign the data engineer the Contributor role for Workspace1\nThe Contributor role allows users to read and write data to lakehouse tables.\nHowever, table-level security can still restrict access to specific tables like Employee.\nE. Migrate the Employee table from Lakehouse1 to Lakehouse2\nThis isolates the PII data in a separate lakehouse.\nSince the data engineer won’t have access to Lakehouse2, they won’t be able to read the Employee table, even if they have Contributor access to Lakehouse1.\n\nThe three correct actions to take are:\n\nE. Migrate the Employee table from Lakehouse1 to Lakehouse2 — This isolates sensitive data (Employee table) from the data engineer’s access.\n\nD. Assign the data engineer the Contributor role for Workspace1 — This allows the data engineer to write to the Customer table in Lakehouse1.\n\nF. Create a new workspace named Workspace2 that contains a new lakehouse named Lakehouse2 — This action is a result of migrating the Employee table to Lakehouse2 in a separate workspace (Workspace2) to ensure restricted access to sensitive data (PII).\n\nWhy Option A is Incorrect:\nA. Share Lakehouse1 with the data engineer:\n\nSharing only gives read access to the lakehouse, which is not sufficient for the data engineer to write data to the Customer table in Lakehouse1. They need write permissions to modify the table, so Contributor role for Workspace1 is the correct option.\n\nSince only 3 answers needed to be selected ADE\n\nbelive me..\n\nC. Assign the Viewer role for Workspace2:\n\nThis ensures the data engineer can see the structure and metadata of the workspace without accessing sensitive Employee table data. They can still write to the Customer table without elevated permissions.\nE. Migrate the Employee table from Lakehouse1 to Lakehouse2:\n\nThis separates Personally Identifiable Information (PII) from the original lakehouse, ensuring the data engineer does not have access to sensitive data while working with non-PII data.\nF. Create Workspace2 with Lakehouse2:\n\nThis creates an isolated environment specifically for sensitive data like the Employee table. It ensures workspace-level access control and adheres to privacy and security best practices.\n\nThe steps are F, E, D\n\nSo, in this case, your answer DEF makes sense as it covers the necessary steps:\n\nCreate a new workspace and lakehouse (Workspace2 and Lakehouse2).\n\nMigrate the Employee table to the new lakehouse.\n\nAssign the data engineer the Contributor role in the original workspace.\n\nIf we are migrating the Employee table to Lakehouse 2 in the workspace 2 , what is wrong in sharing the Lakehouse 1 with the data engineer ? \nMy answer would be A, E, F\n\nbut then you ultimately would have to give the data engineer a contributor access to workspace 1 for him to work on the lakehouse as far as i think.\n\nCurrently uou can't give write access via Lakehouse sharing. https://learn.microsoft.com/en-us/fabric/data-engineering/lakehouse-sharing.  So it is DEF",
  "question_type": "multiple_choice",
  "source": "direct_html",
  "url": "https://www.examtopics.com/discussions/microsoft/view/152633-exam-dp-700-topic-1-question-9-discussion/",
  "topic": 1,
  "question_number": 9
}