{
  "question_text": "Case Study -<br/><br/>This is a case study. Case studies are not timed separately. You can use as much exam time as you would like to complete each case. However, there may be additional case studies and sections on this exam. You must manage your time to ensure that you are able to complete all questions included on this exam in the time provided.<br/><br/>To answer the questions included in a case study, you will need to reference information that is provided in the case study. Case studies might contain exhibits and other resources that provide more information about the scenario that is described in the case study. Each question is independent of the other questions in this case study.<br/><br/>At the end of this case study, a review screen will appear. This screen allows you to review your answers and to make changes before you move to the next section of the exam. After you begin a new section, you cannot return to this section.<br/><br/><br/>To start the case study -<br/>To display the first question in this case study, click the Next button. Use the buttons in the left pane to explore the content of the case study before you answer the questions. Clicking these buttons displays information such as business requirements, existing environment, and problem statements. If the case study has an All Information tab, note that the information displayed is identical to the information displayed on the subsequent tabs. When you are ready to answer a question, click the Question button to return to the question.<br/><br/><br/>Overview -<br/><br/>Litware, Inc. is a publishing company that has an online bookstore and several retail bookstores worldwide. Litware also manages an online advertising business for the authors it represents.<br/><br/>Existing Environment. Fabric Environment<br/><br/>Litware has a Fabric workspace named Workspace1. High concurrency is enabled for Workspace1.<br/><br/>The company has a data engineering team that uses Python for data processing.<br/><br/>Existing Environment. Data Processing<br/><br/>The retail bookstores send sales data at the end of each business day, while the online bookstore constantly provides logs and sales data to a central enterprise resource planning (ERP) system.<br/><br/>Litware implements a medallion architecture by using the following three layers: bronze, silver, and gold. The sales data is ingested from the ERP system as Parquet files that land in the Files folder in a lakehouse. Notebooks are used to transform the files in a Delta table for the bronze and silver layers. The gold layer is in a warehouse that has V-Order disabled.<br/><br/>Litware has image files of book covers in Azure Blob Storage. The files are loaded into the Files folder.<br/><br/>Existing Environment. Sales Data<br/><br/>Month-end sales data is processed on the first calendar day of each month. Data that is older than one month never changes.<br/><br/>In the source system, the sales data refreshes every six hours starting at midnight each day.<br/><br/>The sales data is captured in a Dataflow Gen1 dataflow. When the dataflow runs, new and historical data is captured. The dataflow captures the following fields of the source:<br/><br/>•\tSales Date<br/>•\tAuthor<br/>•\tPrice<br/>•\tUnits<br/>•\tSKU<br/><br/>A table named AuthorSales stores the sales data that relates to each author. The table contains a column named AuthorEmail. Authors authenticate to a guest Fabric tenant by using their email address.<br/><br/>Existing Environment. Security Groups<br/><br/>Litware has the following security groups:<br/><br/>•\tSales<br/>•\tFabric Admins<br/>•\tStreaming Admins<br/><br/>Existing Environment. Performance Issues<br/><br/>Business users perform ad-hoc queries against the warehouse. The business users indicate that reports against the warehouse sometimes run for two hours and fail to load as expected. Upon further investigation, the data engineering team receives the following error message when the reports fail to load: “The SQL query failed while running.”<br/><br/>The data engineering team wants to debug the issue and find queries that cause more than one failure.<br/><br/>When the authors have new book releases, there is often an increase in sales activity. This increase slows the data ingestion process.<br/><br/>The company’s sales team reports that during the last month, the sales data has NOT been up-to-date when they arrive at work in the morning.<br/><br/><br/>Requirements. Planned Changes -<br/><br/>Litware recently signed a contract to receive book reviews. The provider of the reviews exposes the data in Amazon Simple Storage Service (Amazon S3) buckets.<br/><br/>Litware plans to manage Search Engine Optimization (SEO) for the authors. The SEO data will be streamed from a REST API.<br/><br/><br/>Requirements. Version Control -<br/><br/>Litware plans to implement a version control solution in Fabric that will use GitHub integration and follow the principle of least privilege.<br/><br/>Requirements. Governance Requirements<br/><br/>To control data platform costs, the data platform must use only Fabric services and items. Additional Azure resources must NOT be provisioned.<br/><br/><br/>Requirements. Data Requirements -<br/><br/>Litware identifies the following data requirements:<br/><br/>•\tProcess the SEO data in near-real-time (NRT).<br/>•\tMake the book reviews available in the lakehouse without making a copy of the data.<br/>•\tWhen a new book cover image arrives in the Files folder, process the image as soon as possible.<br/><br/><br/>What should you do to optimize the query experience for the business users?",
  "question_images": [],
  "answers": {
    "A": "Enable V-Order.",
    "B": "Create and update statistics.",
    "C": "Run the VACUUM command.",
    "D": "Introduce primary keys."
  },
  "answer_images": {},
  "correct_answer": [
    "B"
  ],
  "correct_answer_images": [],
  "discussion": "Lets check all options:\nA. Enable V-Order: Optimizes read performance by reordering data for faster retrieval, but it primarily addresses storage efficiency rather than query execution. Best for improving large-scale analytics. \n\nB. Create and update statistics: Enhances query optimization by enabling the query engine to make better execution plans, directly addressing the root cause of query performance issues. \n\nC. Run the VACUUM command: Removes obsolete files from storage to free up space. It improves storage maintenance but has minimal impact on query execution performance. \n\nD. Introduce primary keys: Ensures data integrity, but it does not significantly improve query performance in this scenario. \n\nGiven the context of query optimization issues, Option B (Create and update statistics) is likely the most relevant.\n\nTo optimize the query experience for the business users, you should create and update statistics. This helps the query optimizer to generate efficient execution plans by providing relevant information about the data.\n\nEnabling V-Order can indeed improve query performance by optimizing read times through special sorting, row group distribution, dictionary encoding, and compression. However, in your scenario, the primary issue seems to be related to query optimization rather than read performance.\n\nA. Enable V-Order: Optimizes read performance by reordering data for faster retrieval from the  underlying delta table\n\nCreate and update statistics helps the query optimizer generate more efficient query plans reducing time-outs. VOrder can optimise query times but once disabled at the warehouse level it cannot be enabled. \nhttps://learn.microsoft.com/en-us/fabric/data-warehouse/v-order\nThe other options are valid for storage and query optimisation but the question specifies execution failure rather than extremely slow performance.\n\nCreate and update statistics helps the query optimizer generate efficient query plans. Also valid, but less fundamental than storage format optimization. so I choose A\n\nB is correct\n\nA. Enable V-Order.\n\nB and D\n\nThe current gold layer is stored in the warehouse, and it is explicitly stated that \"V-Order is disabled.\"\nEnabling V-Order would be a highly reasonable and effective action.\n\nCurrently, disabling V-Order can only be done at the warehouse level, and it is irreversible: once disabled, it cannot be enabled again.\nhttps://learn.microsoft.com/en-us/fabric/data-warehouse/v-order",
  "question_type": "multiple_choice",
  "source": "direct_html",
  "url": "https://www.examtopics.com/discussions/microsoft/view/302562-exam-dp-700-topic-3-question-11-discussion/",
  "topic": 3,
  "question_number": 11
}