{
  "question_text": "HOTSPOT -<br/>You have three users named User1, User2, and User3.<br/>You have the Fabric workspaces shown in the following table.<br/><img src=\"https://img.examtopics.com/dp-700/image15.png\" title=\"image16\"/><br/>You have a security group named Group1 that contains User1 and User3.<br/>The Fabric admin creates the domains shown in the following table.<br/><img src=\"https://img.examtopics.com/dp-700/image16.png\" title=\"image17\"/><br/>User1 creates a new workspace named Workspace3.<br/>You add Group1 to the default domain of Domain1.<br/>For each of the following statements, select Yes if the statement is true. Otherwise, select No.<br/>NOTE: Each correct selection is worth one point.<br/><img src=\"https://img.examtopics.com/dp-700/image17.png\" title=\"image18\"/>",
  "question_images": [
    "https://img.examtopics.com/dp-700/image15.png",
    "https://img.examtopics.com/dp-700/image16.png",
    "https://img.examtopics.com/dp-700/image17.png"
  ],
  "answers": {},
  "answer_images": {},
  "correct_answer": [],
  "correct_answer_images": [
    "https://img.examtopics.com/dp-700/image18.png"
  ],
  "discussion": "NYN\nBeing a domain contributor doesn't give you any permissions on the workspace itself, only on the domain. Workspace roles are set differently. This excludes the first and last option.\nUser 3 will be domain contributor on the new workspace. Even though without domain admin permissions, there's nothing user 3 can do with Workspace 3.\n\nN Y N\nhttps://learn.microsoft.com/en-us/fabric/governance/domains\nBeing a domain contributor doesn't give you any permissions on the workspace itself, only on the domain. Workspace roles are set differently. This excludes the first and last option.\nUser 3 will be domain contributor on the new workspace. Even though without domain admin permissions, there's nothing user 3 can do with Workspace 3.\n\nWhy \"User 3 will be domain contributor on the new workspace\"? In https://learn.microsoft.com/en-us/fabric/governance/domains#default-domain, it is written that \"The specified users and/or members of the specified security groups GENERALLY automatically become domain contributors of workspaces that are assigned in this manner.\" but we have a word GENERALLY here...\n\nNYN\nUser1 creates a new workspace named Workspace3 - at this moment the Workspace3 is unassigned, i.e. no domain.\nWhen Group1 (User1 and User3) is added to the default domain of Domain1:\n 1. \"When you add people to the default domain list, unassigned workspaces they're admins of, and new workspaces they create, will automatically be assigned to the domain\". \nI.e. Workspace3 is assigned to Domain1\n\t2. \"The users and/or members of the security groups specified in the default domain definition generally automatically become domain contributors of the workspaces that get assigned to the domain via the default domain mechanism.\"\nI.e User3 becomes Domain1 contributor, not Viewer. \nFrom <https://learn.microsoft.com/en-us/fabric/governance/domains#create-subdomains>\n\nY-N-N\nY -  whenever a specified user or member of a specified security group creates a new workspace, it is assigned to the default domain.\n\nhttps://learn.microsoft.com/en-us/fabric/governance/domains\nN - Domain admins must be explicitly set by the domain admin or Fabric admin\nN - Contributor role access to a workspace must be set by the Admin or Member of the workspace\n\nNYN \nUsers or groups assigned to a domain’s default group automatically receive the Domain Contributor role.\n\nhttps://learn.microsoft.com/en-us/fabric/governance/domains#define-the-domain-as-a-default-domain\n\n\"\"\"\nTo define a domain as a default domain, you must be a Fabric admin or a domain admin of the domain.\nSelect Default domain and specify users and/or security groups. When you add people to the default domain list, unassigned workspaces they're admins of, and new workspaces they create, will automatically be assigned to the domain.\n\"\"\"\n\nUser1 creates a new workspace named Workspace3. So WS3 is assigned to the domain 1\n\n\"\"\"\nNote\nThe users and/or members of the security groups specified in the default domain definition generally automatically become domain contributors of the workspaces that get assigned to the domain via the default domain mechanism.\n\"\"\"\n\nUser3 is on security Group1, which is assigned to Domain1. So User3 has Domain contributor access to Domain1.\n\n\nStatement 2 -> Y\n\nN Y N\nhttps://learn.microsoft.com/en-us/fabric/governance/domains\nDefault domain\nA default domain is a domain that has been defined as the default domain for specified users and/or security groups. When you define a domain as the default domain for specified users and/or security groups, the following happens:\n\nThe system scans the organization's workspaces. When it finds a workspace whose admin is a specified user or member of a specified security group:\nIf the workspace already has a domain assignment, it is preserved. The default domain doesn't override the current assignment.\nIf the workspace is unassigned, it is assigned to the default domain.\nAfter this, whenever a specified user or member of a specified security group creates a new workspace, it is assigned to the default domain.\nThe specified users and/or members of the specified security groups generally automatically become domain contributors of workspaces that are assigned in this manner.\n\nWhen a workspace is created by a user who is a member of a domain, that workspace is automatically associated with that domain.\nYou can configure a default domain group (e.g., Group1) for a domain, and:\nThat group gains the Domain Contributor role for all workspaces in the domain.\nThis does not grant workspace-level Viewer or Contributor roles.\nLet’s apply that to your scenario:\nUser3 and Group1:\nGroup1 contains User3\nGroup1 is the default domain group for Domain1\nSo, User3 has the Domain Contributor role in Domain1\nStatement 2: \"User3 has Domain contributor access to Domain1\"  YES\nStatement 1: \"User3 has Viewer role access to Workspace3\"  NO\nBecause domain roles don’t give workspace Viewer permissions.\nUser2 and Workspace3:\nUser2 is not a member of Group1\nUser2 did not create Workspace3\nNo indication they were added to it manually\nStatement 3: \"User2 has Contributor access to Workspace3\"  NO\n\nN/Y/N\n\nhttps://learn.microsoft.com/en-us/fabric/governance/domains#default-domain\n\nN,N,N\nUser3 doesn't have Viewer or Domain contributor access because Group1 was only added to the default domain, not explicitly granted permissions. User2 has no access to Workspace3 since User1 created it and didn’t add User2. Therefore, all three statements are false.\n\nDefault domain\nWhen you add people to this list their new and unassigned workspaces will be automatically assigned to the domain. It also makes them domain contributors.\n\nThis is from MS Fabric itself. So, NYN.\n\nfinally a voice of sanity in this pile of garbage\n\nmy bad, it's NYN actually\n\"\nThe specified users and/or members of the specified security groups generally automatically become domain contributors of workspaces that are assigned in this manner.\n\"\nhttps://learn.microsoft.com/en-us/fabric/governance/domains#default-domain\n\nNYN is correct\n\nY/Y/N\nI think User 3 has Domain contributor access based on the document: https://learn.microsoft.com/en-us/fabric/governance/domains\n\nWhen you define a domain (Domain1) as the default domain for specified users and/or security groups (Group1), the system scans the organization's workspaces. When it finds a workspace whose admin (User1) is a specified user or member of a specified security group (Group1). If the workspace is unassigned (Workspace3), it is assigned to the default domain (Domain1). The specified users and/or members of the specified security groups (User 1 and User3) generally automatically become domain contributors of workspaces (Workspace3) that are assigned in this manner.\n\nShould be Y Y N\nhttps://learn.microsoft.com/en-us/fabric/governance/domains\n\"After this, whenever a specified user or member of a specified security group creates a new workspace, it is assigned to the default domain.\nThe specified users and/or members of the specified security groups generally automatically become domain contributors of workspaces that are assigned in this manner.\"\n\nI correct myself. The answer is Correct.  Y N N. \nMind the order of things\n\nY Y N\nhttps://learn.microsoft.com/en-us/fabric/governance/domains",
  "question_type": "image_only",
  "source": "direct_html",
  "url": "https://www.examtopics.com/discussions/microsoft/view/155288-exam-dp-700-topic-1-question-24-discussion/",
  "topic": 1,
  "question_number": 24
}