{
  "question_text": "You have a Fabric workspace that contains a semantic model named Model1.<br/>You need to dynamically execute and monitor the refresh progress of Model1.<br/>What should you use?",
  "question_images": [],
  "answers": {
    "A": "dynamic management views in Microsoft SQL Server Management Studio (SSMS)",
    "B": "Monitoring hub",
    "C": "dynamic management views in Azure Data Studio",
    "D": "a semantic link in a notebook"
  },
  "answer_images": {},
  "correct_answer": [
    "D"
  ],
  "correct_answer_images": [],
  "discussion": "If the definition of \"dynamic\" is the ability to execute and monitor in real-time, a semantic link in a notebook could be more suitable than the monitoring hub.\n\nB. Monitoring hub\n\nA. dynamic management views in SSMS\tDMVs in SSMS are for SQL databases or warehouses — not for Fabric semantic models.\nB. Monitoring hub\tThe Monitoring hub shows execution history and status after the refresh starts, but it does not allow dynamic execution or programmatic monitoring.\nC. dynamic management views in Azure Data Studio\tSame limitation as SSMS — works for SQL engines, not semantic models in Fabric.\nD. a semantic link in a notebook\t✅ Correct — allows dynamic execution (start refresh) and programmatic monitoring of refresh status\n\nB. Monitoring hub\n\n🧠 Explanation:\nThe Monitoring hub in Microsoft Fabric is designed to track and monitor refresh progress of semantic models (like Model1) in real time.\nIt provides status updates, duration, success/failure logs, and refresh history.\nWhy not the others?\nA & C (DMVs in SSMS/Azure Data Studio): These are used for querying metadata but don’t support dynamic execution or real-time monitoring in Fabric.\nD (Semantic link in a notebook): Used for querying semantic models, not for refreshing or monitoring them.\n\nMaybe the idea behind a dynamic execution it so take action based on the failed refresh so like a retry or something? It makes sense to be semantic link then.\n\nSemantic links are used to query semantic models from notebooks, not for monitoring refresh progress. In Monitoring hub its possible to monitor the refresh status and execute whenever you wish\n\nThe correct answer is: B. Monitoring hub\nIn Microsoft Fabric, the Monitoring hub is the appropriate tool to dynamically execute and monitor the refresh progress of semantic models like Model1. It provides visibility into refresh operations, including status, duration, and any errors encountered.\nHere’s why the other options are not suitable:\n•\tA. Dynamic management views in SSMS: These are used for SQL Server databases, not for monitoring semantic model refreshes in Fabric.\n•\tC. Dynamic management views in Azure Data Studio: Similar to SSMS, these are for database-level diagnostics, not for semantic model refresh tracking in Fabric.\n•\tD. A semantic link in a notebook: Semantic links allow querying semantic models from notebooks but do not provide monitoring capabilities for refresh operations.\nRef: https://learn.microsoft.com/en-us/fabric/data-factory/semantic-model-refresh-activity\n\nI agree with D. Monitoring hub only allows monitoring the refresh progress but not executing the refresh.\n\nB is not right answer because monitoring hub cannot provide with dinamyc execution\n\nMonitoring HUB \n\nReal-time visibility into refresh operations.\nExecution status, duration, and error details.\n\nB is correct\n\nLet me correct that: \nCorrect is option D (Semantic link in a notebook) because allows both actions:\n-Dynamically triggering the refresh (using Python, Spark, or KQL code)\n-Monitoring the status and progress from the same notebook, even reacting to errors\n\nSo, Why Is the Official Answer Still B. Monitoring hub?\nScenario\tBest Option\nManual / UI-based monitoring\t✅ Monitoring hub\nAutomated / programmatic monitoring\t✅ Notebook + semantic link (your method)\n\nSo your code is valid and powerful, especially for automation or scheduled monitoring, but if the exam or question context is asking for standard UI tools, then Monitoring hub (B) is the expected answer.\n\nQuestion not clear. If it is monitoring the refresh then Option b, if it is dynamically triggering the refresh then Option D\n\nNot clear the meaning of dynamic....checking a failed exection using the monitor hub we can rerun and follow the execution\n\nquestion is not clear. what they need with dynamic. If I need to react to a specific message I can work with semantic link. but if i need to manualy check the result the option is B\n\nThis is correct\n\ni think that both of B or D allow to achive this monitoriung refresh of model 1, however, it was specified that oui need to have the refresh progress  (refresh status) and not historical duration for instance. therefore, Monitor hub is the suitable way to see it.",
  "question_type": "multiple_choice",
  "source": "direct_html",
  "url": "https://www.examtopics.com/discussions/microsoft/view/153705-exam-dp-700-topic-1-question-32-discussion/",
  "topic": 1,
  "question_number": 32
}