{
  "question_text": "You are building a Fabric notebook named MasterNotebook1 in a workspace. MasterNotebook1 contains the following code.<br/><br/><img src=\"https://img.examtopics.com/dp-700/image76.png\"/><br/><br/>You need to ensure that the notebooks are executed in the following sequence:<br/><br/>1. Notebook_03<br/>2. Notebook_01<br/>3. Notebook_02<br/><br/>Which two actions should you perform? Each correct answer presents part of the solution.<br/><br/>NOTE: Each correct selection is worth one point.",
  "question_images": [
    "https://img.examtopics.com/dp-700/image76.png"
  ],
  "answers": {
    "A": "Move the declaration of Notebook_02 to the bottom of the Directed Acyclic Graph (DAG) definition.",
    "B": "Add dependencies to the execution of Notebook_03.",
    "C": "Split the Directed Acyclic Graph (DAG) definition into three separate definitions.",
    "D": "Add dependencies to the execution of Notebook_02.",
    "E": "Change the concurrency to 3.",
    "F": "Move the declaration of Notebook_03 to the top of the Directed Acyclic Graph (DAG) definition."
  },
  "answer_images": {},
  "correct_answer": [
    "D",
    "F"
  ],
  "correct_answer_images": [],
  "discussion": "I would also add dependencies to Notebook_01 but it was not listed\n\nD,F - Concurrency set to 0 means they will start all at once. So add dependencies and change the order. https://learn.microsoft.com/en-us/azure/synapse-analytics/spark/microsoft-spark-utilities?pivots=programming-language-python#reference-run-multiple-notebooks-in-parallel\n\nThe answer is absolutely correct and yes, both notebook 2 and notebook 3 (not notebook 1 as suggested by some comments) need to have dependencies defined just like the comment in this sample code from microsoft documentation implies: https://learn.microsoft.com/en-us/fabric/data-engineering/microsoft-spark-utilities. The example from this link is also with 3 notebooks an the third one is dependent on the first one which is why the third one has the first one defined as a dependency, just like notebook 3 in the question would have notebook 2 defined as its dependency.\n\nSorry, my mistake, since notebook 3 needs to run first it does not have a dependency. Notebook 1 and 2 should have the dependency but this is not included in the provided answers which is why I am going for D and E. The concurrency makes no sense as they need to execute one after another, I know, but the order of declarations in DAG makes no difference what so ever, so this is me choosing the lesser evil so to say.\n\nI think that is all wrong in this question, the subject query and the answers. But, besides of that, what seems to be more racional here is D and F .\n\nThere is an error in the answers, or question. \n\nConcurrency specifies the number of parallel threads. \n3 would mean all 3 can run simultaneously. \n0 means no limit and all 3 can run simultaneously. \nIf it were 1, so there had to execute one at a time. The order would be determined by the internal logical of the executor, unless specified by the user via dependencies.\nThe order of the statements does not affect execution. \n\nIt won't matter which order the objects are specified in.\n02 needs to depend on 01\n01 needs to depend on 02\n03 needs no dependencies.\n\nThis is the correct answer, here is why:\n\n1) the activities order in the json don't matter, only the dependency definition\n2) Concurrency = 0 mean no parallele execution.\n\nSo if you define a dependency on note3 to note2 and on note2 to note1, this will FORCE the execution in the right order.\n\nFinally, having notebook3 defined two times with exactly the same parameters will not create errors but it will be execute as last activity.\n\nConcurrency = 0 means No limit on concurrency, i.e. All notebooks or tasks in the DAG can run in parallel, as long as their dependencies are satisfied.\n\n1) Concurrencies is set to 0 meaning the order of the activities will be respected even without dependencies.\n2) you just have to be sure the order is set correctly so moving 3 on top\n\nConcurrency = 0 means No limit on concurrency, i.e. All notebooks or tasks in the DAG can run in parallel, as long as their dependencies are satisfied.\nhttps://learn.microsoft.com/en-us/fabric/data-engineering/spark-job-concurrency-and-queueing\n\nTheir is something seriously wrong with this question. I think their are 2 mistakes in the question itself. First of all their are 2 definitions for notebook 3. Secondly, the answers have a mistake where their should be a dependency on Notebook 3 and Notebook 1. Not Notebook 3 and Notebook 2.\n\nI'm sorry, the responses are wrongly worded. \n\nWe need to set dependencies within 01 und 02 and not within 03. Actully only D should be right IMO. This answer options ar weired.\n\nTheir is something seriously wrong with this question. I think their are 2 mistakes in the question itself. First of all their are 2 definitions for notebook 3. Secondly, the answers have a mistake where their should be a dependency on Notebook 3 and Notebook 1. Not Notebook 3 and Notebook 2.\n\nExplanation:\nTo enforce the required sequence:\n\nSet Notebook_03 to execute first (no dependencies needed).\n\nThen set Notebook_01 to depend on Notebook_03.\n\nThen set Notebook_02 to depend on Notebook_01.\n\nThis is achieved by adding the \"dependsOn\" key to each not\n\nThe execution order in a DAG is only ensured by dependencies, not the position in the defining data structure (JSON).\n\nWrong, ignore.\n\nBD is correct\n\nWhy BD is best answer:\nSequence of activity declaration wont matter till the time you have dependencies written for Notebook1 in Notebook 03, and Notebook 02 dependency on Notebook 01.  So no need to move notebook 03 on top\n\nAnother thing they will execute in parallel if there are no dependencies mentioned.\n\nDF: Finally after long thinking and being lost in verbiage. \nConcurrency is set to 0: They will start executing all together\nSo best option is to move notebook 3 on top\nAdd dependency to notebook 2.\n\nBut this will still not solve the problem, as we need to add dependency in Notebook1 for notebook 2, or change concurrency to 1. And moreover delete the duplication of notebook 3 execution.\nSo overall this question is either stupid or wrong options are mentioned. Does not make sense at all. Whatever you choose from here it will never work.\n\nWhat am i missing here? Why is notebook_03 mentioned twice? Also moving Notebook_03 to the top already solves the entire problem since the concurrency is set to 1. There is no need to add a dependency for execution order since 1 and 2 are already ordered correctly.\n\nWhy Not Other Options?\nA/F (Moving declarations): Order in the DAG array doesn’t control execution sequence; dependencies do.\n\nC (Splitting DAG): Unnecessary; a single DAG with dependencies works.\n\nE (Concurrency=3): Irrelevant for sequential execution (use concurrency=1 if strict order is needed).\n\nWhy is Notebook_03 listed two times in the code?",
  "question_type": "multiple_choice",
  "source": "direct_html",
  "url": "https://www.examtopics.com/discussions/microsoft/view/302445-exam-dp-700-topic-1-question-52-discussion/",
  "topic": 1,
  "question_number": 52
}